[{"json_dict": null, "banned_by": null, "subreddit_id": "t5_2qh72", "subreddit": "Jokes", "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, there&#39;s a man crawling through the desert.</p>\n\n<p>He&#39;d decided to try his SUV in a little bit of cross-country travel, had\ngreat fun zooming over the badlands and through the sand, got lost, hit a\nbig rock, and then he couldn&#39;t get it started again. There were no cell\nphone towers anywhere near, so his cell phone was useless. He had no family,\nhis parents had died a few years before in an auto accident, and his few\nfriends had no idea he was out here.</p>\n\n<p>He stayed with the car for a day or so, but his one bottle of water ran out\nand he was getting thirsty. He thought maybe he knew the direction back, now\nthat he&#39;d paid attention to the sun and thought he&#39;d figured out which way\nwas north, so he decided to start walking. He figured he only had to go\nabout 30 miles or so and he&#39;d be back to the small town he&#39;d gotten gas in\nlast.</p>\n\n<p>He thinks about walking at night to avoid the heat and sun, but based upon\nhow dark it actually was the night before, and given that he has no\nflashlight, he&#39;s afraid that he&#39;ll break a leg or step on a rattlesnake. So,\nhe puts on some sun block, puts the rest in his pocket for reapplication\nlater, brings an umbrella he&#39;d had in the back of the SUV with him to give\nhim a little shade, pours the windshield wiper fluid into his water bottle\nin case he gets that desperate, brings his pocket knife in case he finds a\ncactus that looks like it might have water in it, and heads out in the\ndirection he thinks is right.</p>\n\n<p>He walks for the entire day. By the end of the day he&#39;s really thirsty. He&#39;s\nbeen sweating all day, and his lips are starting to crack. He&#39;s reapplied\nthe sunblock twice, and tried to stay under the umbrella, but he still feels\nsunburned. The windshield wiper fluid sloshing in the bottle in his pocket\nis really getting tempting now. He knows that it&#39;s mainly water and some\nethanol and coloring, but he also knows that they add some kind of poison to\nit to keep people from drinking it. He wonders what the poison is, and\nwhether the poison would be worse than dying of thirst.</p>\n\n<p>He pushes on, trying to get to that small town before dark.</p>\n\n<p>By the end of the day he starts getting worried. He figures he&#39;s been\nwalking at least 3 miles an hour, according to his watch for over 10 hours.\nThat means that if his estimate was right that he should be close to the\ntown. But he doesn&#39;t recognize any of this. He had to cross a dry creek bed\na mile or two back, and he doesn&#39;t remember coming through it in the SUV. He\nfigures that maybe he got his direction off just a little and that the dry\ncreek bed was just off to one side of his path. He tells himself that he&#39;s\nclose, and that after dark he&#39;ll start seeing the town lights over one of\nthese hills, and that&#39;ll be all he needs.</p>\n\n<p>As it gets dim enough that he starts stumbling over small rocks and things,\nhe finds a spot and sits down to wait for full dark and the town lights.</p>\n\n<p>Full dark comes before he knows it. He must have dozed off. He stands back\nup and turns all the way around. He sees nothing but stars.</p>\n\n<p>He wakes up the next morning feeling absolutely lousy. His eyes are gummy\nand his mouth and nose feel like they&#39;re full of sand. He so thirsty that he\ncan&#39;t even swallow. He barely got any sleep because it was so cold. He&#39;d\nforgotten how cold it got at night in the desert and hadn&#39;t noticed it the\nnight before because he&#39;d been in his car.</p>\n\n<p>He knows the Rule of Threes - three minutes without air, three days without\nwater, three weeks without food - then you die. Some people can make it a\nlittle longer, in the best situations. But the desert heat and having to\nwalk and sweat isn&#39;t the best situation to be without water. He figures,\nunless he finds water, this is his last day.</p>\n\n<p>He rinses his mouth out with a little of the windshield wiper fluid. He\nwaits a while after spitting that little bit out, to see if his mouth goes\nnumb, or he feels dizzy or something. Has his mouth gone numb? Is it just in\nhis mind? He&#39;s not sure. He&#39;ll go a little farther, and if he still doesn&#39;t\nfind water, he&#39;ll try drinking some of the fluid.</p>\n\n<p>Then he has to face his next, harder question - which way does he go from\nhere? Does he keep walking the same way he was yesterday (assuming that he\nstill knows which way that is), or does he try a new direction? He has no\nidea what to do.</p>\n\n<p>Looking at the hills and dunes around him, he thinks he knows the direction\nhe was heading before. Just going by a feeling, he points himself somewhat\nto the left of that, and starts walking.</p>\n\n<p>As he walks, the day starts heating up. The desert, too cold just a couple\nof hours before, soon becomes an oven again. He sweats a little at first,\nand then stops. He starts getting worried at that - when you stop sweating\nhe knows that means you&#39;re in trouble - usually right before heat stroke.</p>\n\n<p>He decides that it&#39;s time to try the windshield wiper fluid. He can&#39;t wait\nany longer - if he passes out, he&#39;s dead. He stops in the shade of a large\nrock, takes the bottle out, opens it, and takes a mouthful. He slowly\nswallows it, making it last as long as he can. It feels so good in his dry\nand cracked throat that he doesn&#39;t even care about the nasty taste. He takes\nanother mouthful, and makes it last too. Slowly, he drinks half the bottle.\nHe figures that since he&#39;s drinking it, he might as well drink enough to\nmake some difference and keep himself from passing out.</p>\n\n<p>He&#39;s quit worrying about the denaturing of the wiper fluid. If it kills him,\nit kills him - if he didn&#39;t drink it, he&#39;d die anyway. Besides, he&#39;s pretty\nsure that whatever substance they denature the fluid with is just designed\nto make you sick - their way of keeping winos from buying cheap wiper fluid\nfor the ethanol content. He can handle throwing up, if it comes to that.</p>\n\n<p>He walks. He walks in the hot, dry, windless desert. Sand, rocks, hills,\ndunes, the occasional scrawny cactus or dried bush. No sign of water.\nSometimes he&#39;ll see a little movement to one side or the other, but whatever\nmoved is usually gone before he can focus his eyes on it. Probably birds,\nlizards, or mice. Maybe snakes, though they usually move more at night. He&#39;s\ncareful to stay away from the movements.</p>\n\n<p>After a while, he begins to stagger. He&#39;s not sure if it&#39;s fatigue, heat\nstroke finally catching him, or maybe he was wrong and the denaturing of the\nwiper fluid was worse than he thought. He tries to steady himself, and keep\ngoing.</p>\n\n<p>After more walking, he comes to a large stretch of sand. This is good! He\nknows he passed over a stretch of sand in the SUV - he remembers doing\ndonuts in it. Or at least he thinks he remembers it - he&#39;s getting woozy\nenough and tired enough that he&#39;s not sure what he remembers any more or if\nhe&#39;s hallucinating. But he thinks he remembers it. So he heads off into it,\ntrying to get to the other side, hoping that it gets him closer to the town.</p>\n\n<p>He was heading for a town, wasn&#39;t he? He thinks he was. He isn&#39;t sure any\nmore. He&#39;s not even sure how long he&#39;s been walking any more. Is it still\nmorning? Or has it moved into afternoon and the sun is going down again? It\nmust be afternoon - it seems like it&#39;s been too long since he started out.</p>\n\n<p>He walks through the sand.</p>\n\n<p>After a while, he comes to a big dune in the sand. This is bad. He doesn&#39;t\nremember any dunes when driving over the sand in his SUV. Or at least he\ndoesn&#39;t think he remembers any. This is bad.</p>\n\n<p>But, he has no other direction to go. Too late to turn back now. He figures\nthat he&#39;ll get to the top of the dune and see if he can see anything from\nthere that helps him find the town. He keeps going up the dune.</p>\n\n<p>Halfway up, he slips in the bad footing of the sand for the second or third\ntime, and falls to his knees. He doesn&#39;t feel like getting back up - he&#39;ll\njust fall down again. So, he keeps going up the dune on his hand and knees.</p>\n\n<p>While crawling, if his throat weren&#39;t so dry, he&#39;d laugh. He&#39;s finally\ngotten to the hackneyed image of a man lost in the desert - crawling through\nthe sand on his hands and knees. If would be the perfect image, he imagines,\nif only his clothes were more ragged. The people crawling through the desert\nin the cartoons always had ragged clothes. But his have lasted without any\nrips so far. Somebody will probably find his dessicated corpse half buried\nin the sand years from now, and his clothes will still be in fine shape -\nshake the sand out, and a good wash, and they&#39;d be wearable again. He wishes\nhis throat were wet enough to laugh. He coughs a little instead, and it\nhurts.</p>\n\n<p>He finally makes it to the top of the sand dune. Now that he&#39;s at the top,\nhe struggles a little, but manages to stand up and look around. All he sees\nis sand. Sand, and more sand. Behind him, about a mile away, he thinks he\nsees the rocky ground he left to head into this sand. Ahead of him, more\ndunes, more sand. This isn&#39;t where he drove his SUV. This is Hell. Or close\nenough.</p>\n\n<p>Again, he doesn&#39;t know what to do. He decides to drink the rest of the wiper\nfluid while figuring it out. He takes out the bottle, and is removing the\ncap, when he glances to the side and sees something. Something in the sand.\nAt the bottom of the dune, off to the side, he sees something strange. It&#39;s\na flat area, in the sand. He stops taking the cap of the bottle off, and\ntries to look closer. The area seems to be circular. And it&#39;s dark - darker\nthan the sand. And, there seems to be something in the middle of it, but he\ncan&#39;t tell what it is. He looks as hard as he can, and still can tell from\nhere. He&#39;s going to have to go down there and look.</p>\n\n<p>He puts the bottle back in his pocket, and starts to stumble down the dune.\nAfter a few steps, he realizes that he&#39;s in trouble - he&#39;s not going to be\nable to keep his balance. After a couple of more sliding, tottering steps,\nhe falls and starts to roll down the dune. The sand it so hot when his body\nhits it that for a minute he thinks he&#39;s caught fire on the way down - like\na movie car wreck flashing into flames as it goes over the cliff, before it\never even hits the ground. He closes his eyes and mouth, covers his face\nwith his hands, and waits to stop rolling.</p>\n\n<p>He stops, at the bottom of the dune. After a minute or two, he finds enough\nenergy to try to sit up and get the sand out of his face and clothes. When\nhe clears his eyes enough, he looks around to make sure that the dark spot\nin the sand it still there and he hadn&#39;t just imagined it.</p>\n\n<p>So, seeing the large, flat, dark spot on the sand is still there, he begins\nto crawl towards it. He&#39;d get up and walk towards it, but he doesn&#39;t seem to\nhave the energy to get up and walk right now. He must be in the final stages\nof dehydration he figures, as he crawls. If this place in the sand doesn&#39;t\nhave water, he&#39;ll likely never make it anywhere else. This is his last\nchance.</p>\n\n<p>He gets closer and closer, but still can&#39;t see what&#39;s in the middle of the\ndark area. His eyes won&#39;t quite focus any more for some reason. And lifting\nhis head up to look takes so much effort that he gives up trying. He just\nkeeps crawling.</p>\n\n<p>Finally, he reaches the area he&#39;d seen from the dune. It takes him a minute\nof crawling on it before he realizes that he&#39;s no longer on sand - he&#39;s now\ncrawling on some kind of dark stone. Stone with some kind of marking on it -\na pattern cut into the stone. He&#39;s too tired to stand up and try to see what\nthe pattern is - so he just keeps crawling. He crawls towards the center,\nwhere his blurry eyes still see something in the middle of the dark stone\narea.</p>\n\n<p>His mind, detached in a strange way, notes that either his hands and knees\nare so burnt by the sand that they no longer feel pain, or that this dark\nstone, in the middle of a burning desert with a pounding, punishing sun\noverhead, doesn&#39;t seem to be hot. It almost feels cool. He considers lying\ndown on the nice cool surface.</p>\n\n<p>Cool, dark stone. Not a good sign. He must be hallucinating this. He&#39;s\nprobably in the middle of a patch of sand, already lying face down and\ndying, and just imagining this whole thing. A desert mirage. Soon the\nbeautiful women carrying pitchers of water will come up and start giving him\na drink. Then he&#39;ll know he&#39;s gone.</p>\n\n<p>He decides against laying down on the cool stone. If he&#39;s going to die here\nin the middle of this hallucination, he at least wants to see what&#39;s in the\ncenter before he goes. He keeps crawling.</p>\n\n<p>It&#39;s the third time that he hears the voice before he realizes what he&#39;s\nhearing. He would swear that someone just said, &quot;Greetings, traveler. You do\nnot look well. Do you hear me?&quot;</p>\n\n<p>He stops crawling. He tries to look up from where he is on his hands and\nknees, but it&#39;s too much effort to lift his head. So he tries something\ndifferent - he leans back and tries to sit up on the stone. After a few\nseconds, he catches his balance, avoids falling on his face, sits up, and\ntries to focus his eyes. Blurry. He rubs his eyes with the back of his hands\nand tries again. Better this time.</p>\n\n<p>Yep. He can see. He&#39;s sitting in the middle of a large, flat, dark expanse\nof stone. Directly next to him, about three feet away, is a white post or\npole about two inches in diameter and sticking up about four or five feet\nout of the stone, at an angle.</p>\n\n<p>And wrapped around this white rod, tail with rattle on it hovering and\nseeming to be ready to start rattling, is what must be a fifteen foot long\ndesert diamondback rattlesnake, looking directly at him.</p>\n\n<p>He stares at the snake in shock. He doesn&#39;t have the energy to get up and\nrun away. He doesn&#39;t even have the energy to crawl away. This is it, his\nfinal resting place. No matter what happens, he&#39;s not going to be able to\nmove from this spot.</p>\n\n<p>Well, at least dying of a bite from this monster should be quicker than\ndying of thirst. He&#39;ll face his end like a man. He struggles to sit up a\nlittle straighter. The snake keeps watching him. He lifts one hand and waves\nit in the snake&#39;s direction, feebly. The snake watches the hand for a\nmoment, then goes back to watching the man, looking into his eyes.</p>\n\n<p>Hmmm. Maybe the snake had no interest in biting him? It hadn&#39;t rattled yet -\nthat was a good sign. Maybe he wasn&#39;t going to die of snake bite after all.</p>\n\n<p>He then remembers that he&#39;d looked up when he&#39;d reached the center here\nbecause he thought he&#39;d heard a voice. He was still very woozy - he was\nlikely to pass out soon, the sun still beat down on him even though he was\nnow on cool stone. He still didn&#39;t have anything to drink. But maybe he had\nactually heard a voice. This stone didn&#39;t look natural. Nor did that white\npost sticking up out of the stone. Someone had to have built this. Maybe\nthey were still nearby. Maybe that was who talked to him. Maybe this snake\nwas even their pet, and that&#39;s why it wasn&#39;t biting.</p>\n\n<p>He tries to clear his throat to say, &quot;Hello,&quot; but his throat is too dry. All\nthat comes out is a coughing or wheezing sound. There is no way he&#39;s going\nto be able to talk without something to drink. He feels his pocket, and the\nbottle with the wiper fluid is still there. He shakily pulls the bottle out,\nalmost losing his balance and falling on his back in the process. This isn&#39;t\ngood. He doesn&#39;t have much time left, by his reckoning, before he passes\nout.</p>\n\n<p>He gets the lid off of the bottle, manages to get the bottle to his lips,\nand pours some of the fluid into his mouth. He sloshes it around, and then\nswallows it. He coughs a little. His throat feels better. Maybe he can talk\nnow.</p>\n\n<p>He tries again. Ignoring the snake, he turns to look around him, hoping to\nspot the owner of this place, and croaks out, &quot;Hello? Is there anyone here?&quot;</p>\n\n<p>He hears, from his side, &quot;Greetings. What is it that you want?&quot;</p>\n\n<p>He turns his head, back towards the snake. That&#39;s where the sound had seemed\nto come from. The only thing he can think of is that there must be a\nspeaker, hidden under the snake, or maybe built into that post. He decides\nto try asking for help.</p>\n\n<p>&quot;Please,&quot; he croaks again, suddenly feeling dizzy, &quot;I&#39;d love to not be\nthirsty any more. I&#39;ve been a long time without water. Can you help me?&quot;</p>\n\n<p>Looking in the direction of the snake, hoping to see where the voice was\ncoming from this time, he is shocked to see the snake rear back, open its\nmouth, and speak. He hears it say, as the dizziness overtakes him and he\nfalls forward, face first on the stone, &quot;Very well. Coming up.&quot;</p>\n\n<p>A piercing pain shoots through his shoulder. Suddenly he is awake. He sits\nup and grabs his shoulder, wincing at the throbbing pain. He&#39;s momentarily\ndisoriented as he looks around, and then he remembers - the crawl across the\nsand, the dark area of stone, the snake. He sees the snake, still wrapped\naround the tilted white post, still looking at him.</p>\n\n<p>He reaches up and feels his shoulder, where it hurts. It feels slightly wet.\nHe pulls his fingers away and looks at them - blood. He feels his shoulder\nagain - his shirt has what feels like two holes in it - two puncture holes -\nthey match up with the two aching spots of pain on his shoulder. He had been\nbitten. By the snake.</p>\n\n<p>&quot;It&#39;ll feel better in a minute.&quot; He looks up - it&#39;s the snake talking. He\nhadn&#39;t dreamed it. Suddenly he notices - he&#39;s not dizzy any more. And more\nimportantly, he&#39;s not thirsty any more - at all!</p>\n\n<p>&quot;Have I died? Is this the afterlife? Why are you biting me in the\nafterlife?&quot;</p>\n\n<p>&quot;Sorry about that, but I had to bite you,&quot; says the snake. &quot;That&#39;s the way I\nwork. It all comes through the bite. Think of it as natural medicine.&quot;</p>\n\n<p>&quot;You bit me to help me? Why aren&#39;t I thirsty any more? Did you give me a\ndrink before you bit me? How did I drink enough while unconscious to not be\nthirsty any more? I haven&#39;t had a drink for over two days. Well, except for\nthe windshield wiper fluid... hold it, how in the world does a snake talk?\nAre you real? Are you some sort of Disney animation?&quot;</p>\n\n<p>&quot;No,&quot; says the snake, &quot;I&#39;m real. As real as you or anyone is, anyway. I\ndidn&#39;t give you a drink. I bit you. That&#39;s how it works - it&#39;s what I do. I\nbite. I don&#39;t have hands to give you a drink, even if I had water just\nsitting around here.&quot;</p>\n\n<p>The man sat stunned for a minute. Here he was, sitting in the middle of the\ndesert on some strange stone that should be hot but wasn&#39;t, talking to a\nsnake that could talk back and had just bitten him. And he felt better. Not\ngreat - he was still starving and exhausted, but much better - he was no\nlonger thirsty. He had started to sweat again, but only slightly. He felt\nhot, in this sun, but it was starting to get lower in the sky, and the cool\nstone beneath him was a relief he could notice now that he was no longer\ndying of thirst.</p>\n\n<p>&quot;I might suggest that we take care of that methanol you now have in your\nsystem with the next request,&quot; continued the snake. &quot;I can guess why you\ndrank it, but I&#39;m not sure how much you drank, or how much methanol was left\nin the wiper fluid. That stuff is nasty. It&#39;ll make you go blind in a day or\ntwo, if you drank enough of it.&quot;</p>\n\n<p>&quot;Ummm, n-next request?&quot; said the man. He put his hand back on his hurting\nshoulder and backed away from the snake a little.</p>\n\n<p>&quot;That&#39;s the way it works. If you like, that is,&quot; explained the snake. &quot;You\nget three requests. Call them wishes, if you wish.&quot; The snake grinned at his\nown joke, and the man drew back a little further from the show of fangs.</p>\n\n<p>&quot;But there are rules,&quot; the snake continued. &quot;The first request is free. The\nsecond requires an agreement of secrecy. The third requires the binding of\nresponsibility.&quot; The snake looks at the man seriously.</p>\n\n<p>&quot;By the way,&quot; the snake says suddenly, &quot;my name is Nathan. Old Nathan,\nSamuel used to call me. He gave me the name. Before that, most of the Bound\nused to just call me &#39;Snake&#39;. But that got old, and Samuel wouldn&#39;t stand\nfor it. He said that anything that could talk needed a name. He was big into\nnames. You can call me Nate, if you wish.&quot; Again, the snake grinned. &quot;Sorry\nif I don&#39;t offer to shake, but I think you can understand - my shake sounds\nsomewhat threatening.&quot; The snake give his rattle a little shake.</p>\n\n<p>&quot;Umm, my name is Jack,&quot; said the man, trying to absorb all of this. &quot;Jack\nSamson.</p>\n\n<p>&quot;Can I ask you a question?&quot; Jack says suddenly. &quot;What happened to the\npoison...umm, in your bite. Why aren&#39;t I dying now? How did you do that?\nWhat do you mean by that&#39;s how you work?&quot;</p>\n\n<p>&quot;That&#39;s more than one question,&quot; grins Nate. &quot;But I&#39;ll still try to answer\nall of them. First, yes, you can ask me a question.&quot; The snake&#39;s grin gets\nwider. &quot;Second, the poison is in you. It changed you. You now no longer need\nto drink. That&#39;s what you asked for. Or, well, technically, you asked to not\nbe thirsty any more - but &#39;any more&#39; is such a vague term. I decided to make\nit permanent - now, as long as you live, you shouldn&#39;t need to drink much at\nall. Your body will conserve water very efficiently. You should be able to\nget enough just from the food you eat - much like a creature of the desert.\nYou&#39;ve been changed.</p>\n\n<p>&quot;For the third question,&quot; Nate continues, &quot;you are still dying. Besides the\neffects of that methanol in your system, you&#39;re a man - and men are mortal.\nIn your current state, I give you no more than about another 50 years.\nAssuming you get out of this desert, alive, that is.&quot; Nate seemed vastly\namused at his own humor, and continued his wide grin.</p>\n\n<p>&quot;As for the fourth question,&quot; Nate said, looking more serious as far as Jack\ncould tell, as Jack was just now working on his ability to read\ntalking-snake emotions from snake facial features, &quot;first you have to agree\nto make a second request and become bound by the secrecy, or I can&#39;t tell\nyou.&quot;</p>\n\n<p>&quot;Wait,&quot; joked Jack, &quot;isn&#39;t this where you say you could tell me, but you&#39;d\nhave to kill me?&quot;</p>\n\n<p>&quot;I thought that was implied.&quot; Nate continued to look serious.</p>\n\n<p>&quot;Ummm...yeah.&quot; Jack leaned back a little as he remembered again that he was\ntalking to a fifteen foot poisonous reptile with a reputation for having a\nnasty temper. &quot;So, what is this &#39;Bound by Secrecy&#39; stuff, and can you really\nstop the effects of the methanol?&quot; Jack thought for a second. &quot;And, what do\nyou mean methanol, anyway? I thought these days they use ethanol in wiper\nfluid, and just denature it?&quot;</p>\n\n<p>&quot;They may, I don&#39;t really know,&quot; said Nate. &quot;I haven&#39;t gotten out in a\nwhile. Maybe they do. All I know is that I smell methanol on your breath and\non that bottle in your pocket. And the blue color of the liquid when you\npulled it out to drink some let me guess that it was wiper fluid. I assume\nthat they still color wiper fluid blue?&quot;</p>\n\n<p>&quot;Yeah, they do,&quot; said Jack.</p>\n\n<p>&quot;I figured,&quot; replied Nate. &quot;As for being bound by secrecy - with the\nfulfillment of your next request, you will be bound to say nothing about me,\nthis place, or any of the information I will tell you after that, when you\ndecide to go back out to your kind. You won&#39;t be allowed to talk about me,\nwrite about me, use sign language, charades, or even act in a way that will\nlead someone to guess correctly about me. You&#39;ll be bound to secrecy. Of\ncourse, I&#39;ll also ask you to promise not to give me away, and as I&#39;m\nguessing that you&#39;re a man of your word, you&#39;ll never test the binding\nanyway, so you won&#39;t notice.&quot; Nate said the last part with utter confidence.</p>\n\n<p>Jack, who had always prided himself on being a man of his word, felt a\nlittle nervous at this. &quot;Ummm, hey, Nate, who are you? How did you know\nthat? Are you, umm, omniscient, or something?&quot;</p>\n\n<p>Well, Jack,&quot; said Nate sadly, &quot;I can&#39;t tell you that, unless you make the\nsecond request.&quot; Nate looked away for a minute, then looked back.</p>\n\n<p>&quot;Umm, well, ok,&quot; said Jack, &quot;what is this about a second request? What can I\nask for? Are you allowed to tell me that?&quot;</p>\n\n<p>&quot;Sure!&quot; said Nate, brightening. &quot;You&#39;re allowed to ask for changes. Changes\nto yourself. They&#39;re like wishes, but they can only affect you. Oh, and\nbefore you ask, I can&#39;t give you immortality. Or omniscience. Or\nomnipresence, for that matter. Though I might be able to make you gaseous\nand yet remain alive, and then you could spread through the atmosphere and\nsort of be omnipresent. But what good would that be - you still wouldn&#39;t be\nomniscient and thus still could only focus on one thing at a time. Not very\nuseful, at least in my opinion.&quot; Nate stopped when he realized that Jack was\nstaring at him.</p>\n\n<p>&quot;Well, anyway,&quot; continued Nate, &quot;I&#39;d probably suggest giving you permanent\ngood health. It would negate the methanol now in your system, you&#39;d be\nimmune to most poisons and diseases, and you&#39;d tend to live a very long\ntime, barring accident, of course. And you&#39;ll even have a tendency to\nrecover from accidents well. It always seemed like a good choice for a\nrequest to me.&quot;</p>\n\n<p>&quot;Cure the methanol poisoning, huh?&quot; said Jack. &quot;And keep me healthy for a\nlong time? Hmmm. It doesn&#39;t sound bad at that. And it has to be a request\nabout a change to me? I can&#39;t ask to be rich, right? Because that&#39;s not\nreally a change to me?&quot;</p>\n\n<p>&quot;Right,&quot; nodded Nate.</p>\n\n<p>&quot;Could I ask to be a genius and permanently healthy?&quot; Jack asked, hopefully.</p>\n\n<p>&quot;That takes two requests, Jack.&quot;</p>\n\n<p>&quot;Yeah, I figured so,&quot; said Jack. &quot;But I could ask to be a genius? I could\nbecome the smartest scientist in the world? Or the best athlete?&quot;</p>\n\n<p>&quot;Well, I could make you very smart,&quot; admitted Nate, &quot;but that wouldn&#39;t\nnecessarily make you the best scientist in the world. Or, I could make you\nvery athletic, but it wouldn&#39;t necessarily make you the best athlete either.\nYou&#39;ve heard the saying that 99% of genius is hard work? Well, there&#39;s some\ntruth to that. I can give you the talent, but I can&#39;t make you work hard. It\nall depends on what you decide to do with it.&quot;</p>\n\n<p>&quot;Hmmm,&quot; said Jack. &quot;Ok, I think I understand. And I get a third request,\nafter this one?&quot;</p>\n\n<p>&quot;Maybe,&quot; said Nate, &quot;it depends on what you decide then. There are more\nrules for the third request that I can only tell you about after the second\nrequest. You know how it goes.&quot; Nate looked like he&#39;d shrug, if he had\nshoulders.</p>\n\n<p>&quot;Ok, well, since I&#39;d rather not be blind in a day or two, and permanent\nhealth doesn&#39;t sound bad, then consider that my second request. Officially.\nDo I need to sign in blood or something?&quot;</p>\n\n<p>&quot;No,&quot; said Nate. &quot;Just hold out your hand. Or heel.&quot; Nate grinned. &quot;Or\nwhatever part you want me to bite. I have to bite you again. Like I said,\nthat&#39;s how it works - the poison, you know,&quot; Nate said apologetically.</p>\n\n<p>Jack winced a little and felt his shoulder, where the last bite was. Hey, it\ndidn&#39;t hurt any more. Just like Nate had said. That made Jack feel better\nabout the biting business. But still, standing still while a fifteen foot\nsnake sunk it&#39;s fangs into you. Jack stood up. Ignoring how good it felt to\nbe able to stand again, and the hunger starting to gnaw at his stomach, Jack\ntried to decide where he wanted to get bitten. Despite knowing that it\nwouldn&#39;t hurt for long, Jack knew that this wasn&#39;t going to be easy.</p>\n\n<p>&quot;Hey, Jack,&quot; Nate suddenly said, looking past Jack towards the dunes behind\nhim, &quot;is that someone else coming up over there?&quot;</p>\n\n<p>Jack spun around and looked. Who else could be out here in the middle of\nnowhere? And did they bring food?</p>\n\n<p>Wait a minute, there was nobody over there. What was Nate...</p>\n\n<p>Jack let out a bellow as he felt two fangs sink into his rear end, through\nhis jeans...</p>\n\n<p>Jack sat down carefully, favoring his more tender buttock. &quot;I would have\ndecided, eventually, Nate. I was just thinking about it. You didn&#39;t have to\nhoodwink me like that.&quot;</p>\n\n<p>&quot;I&#39;ve been doing this a long time, Jack,&quot; said Nate, confidently. &quot;You\nhumans have a hard time sitting still and letting a snake bite you -\nespecially one my size. And besides, admit it - it&#39;s only been a couple of\nminutes and it already doesn&#39;t hurt any more, does it? That&#39;s because of the\nhealth benefit with this one. I told you that you&#39;d heal quickly now.&quot;</p>\n\n<p>&quot;Yeah, well, still,&quot; said Jack, &quot;it&#39;s the principle of the thing. And nobody\nlikes being bitten in the butt! Couldn&#39;t you have gotten my calf or\nsomething instead?&quot;</p>\n\n<p>&quot;More meat in the typical human butt,&quot; replied Nate. &quot;And less chance you\naccidentally kick me or move at the last second.&quot;</p>\n\n<p>&quot;Yeah, right. So, tell me all of these wonderful secrets that I now qualify\nto hear,&quot; answered Jack.</p>\n\n<p>&quot;Ok,&quot; said Nate. &quot;Do you want to ask questions first, or do you want me to\njust start talking?&quot;</p>\n\n<p>&quot;Just talk,&quot; said Jack. &quot;I&#39;ll sit here and try to not think about food.&quot;</p>\n\n<p>&quot;We could go try to rustle up some food for you first, if you like,&quot;\nanswered Nate.</p>\n\n<p>&quot;Hey! You didn&#39;t tell me you had food around here, Nate!&quot; Jack jumped up.\n&quot;What do we have? Am I in walking distance to town? Or can you magically\nwhip up food along with your other powers?&quot; Jack was almost shouting with\nexcitement. His stomach had been growling for hours.</p>\n\n<p>&quot;I was thinking more like I could flush something out of its hole and bite\nit for you, and you could skin it and eat it. Assuming you have a knife,\nthat is,&quot; replied Nate, with the grin that Jack was starting to get used to.</p>\n\n<p>&quot;Ugh,&quot; said Jack, sitting back down. &quot;I think I&#39;ll pass. I can last a little\nlonger before I get desperate enough to eat desert rat, or whatever else it\nis you find out here. And there&#39;s nothing to burn - I&#39;d have to eat it raw.\nNo thanks. Just talk.&quot;</p>\n\n<p>&quot;Ok,&quot; replied Nate, still grinning. &quot;But I&#39;d better hurry, before you start\nlooking at me as food.</p>\n\n<p>Nate reared back a little, looked around for a second, and then continued.\n&quot;You, Jack, are sitting in the middle of the Garden of Eden.&quot;</p>\n\n<p>Jack looked around at the sand and dunes and then looked back at Nate\nsceptically.</p>\n\n<p>&quot;Well, that&#39;s the best I can figure it, anyway, Jack,&quot; said Nate. &quot;Stand up\nand look at the symbol on the rock here.&quot; Nate gestured around the dark\nstone they were both sitting on with his nose.</p>\n\n<p>Jack stood up and looked. Carved into the stone in a bas-relief was a\nrepresentation of a large tree. The angled-pole that Nate was wrapped around\nwas coming out of the trunk of the tree, right below where the main branches\nleft the truck to reach out across the stone. It was very well done - it\nlooked more like a tree had been reduced to almost two dimensions and\nembedded in the stone than it did like a carving.</p>\n\n<p>Jack walked around and looked at the details in the fading light of the\nsetting sun. He wished he&#39;d looked at it while the sun was higher in the\nsky.</p>\n\n<p>Wait! The sun was setting! That meant he was going to have to spend another\nnight out here! Arrrgh!</p>\n\n<p>Jack looked out across the desert for a little bit, and then came back and\nstood next to Nate. &quot;In all the excitement, I almost forgot, Nate,&quot; said\nJack. &quot;Which way is it back to town? And how far? I&#39;m eventually going to\nhave to head back - I&#39;m not sure I&#39;ll be able to survive by eating raw\ndesert critters for long. And even if I can, I&#39;m not sure I&#39;ll want to.&quot;</p>\n\n<p>&quot;It&#39;s about 30 miles that way.&quot; Nate pointed, with the rattle on his tail\nthis time. As far as Jack could tell, it was a direction at right angles to\nthe way he&#39;d been going when he was crawling here. &quot;But that&#39;s 30 miles by\nthe way the crow flies. It&#39;s about 40 by the way a man walks. You should be\nable to do it in about half a day with your improved endurance, if you head\nout early tomorrow, Jack.&quot;</p>\n\n<p>Jack looked out the way the snake had pointed for a few seconds more, and\nthen sat back down. It was getting dark. Not much he could do about heading\nout right now. And besides, Nate was just about to get to the interesting\nstuff. &quot;Garden of Eden? As best as you can figure it?&quot;</p>\n\n<p>&quot;Well, yeah, as best as I and Samuel could figure it anyway,&quot; said Nate. &quot;He\nfigured that the story just got a little mixed up. You know, snake, in a\n&#39;tree&#39;, offering &#39;temptations&#39;, making bargains. That kind stuff. But he\ncould never quite figure out how the Hebrews found out about this spot from\nacross the ocean. He worried about that for a while.&quot;</p>\n\n<p>&quot;Garden of Eden, hunh?&quot; said Jack. &quot;How long have you been here, Nate?&quot;</p>\n\n<p>&quot;No idea, really,&quot; replied Nate. &quot;A long time. It never occurred to me to\ncount years, until recently, and by then, of course, it was too late. But I\ndo remember when this whole place was green, so I figure it&#39;s been thousands\nof years, at least.&quot;</p>\n\n<p>&quot;So, are you the snake that tempted Eve?&quot; said Jack.</p>\n\n<p>&quot;Beats me,&quot; said Nate. &quot;Maybe. I can&#39;t remember if the first one of your\nkind that I talked to was female or not, and I never got a name, but it\ncould have been. And I suppose she could have considered my offer to grant\nrequests a &#39;temptation&#39;, though I&#39;ve rarely had refusals.&quot;</p>\n\n<p>&quot;Well, umm, how did you get here then? And why is that white pole stuck out\nof the stone there?&quot; asked Jack.</p>\n</div><!-- SC_ON -->", "selftext": "So, there's a man crawling through the desert.\n\nHe'd decided to try his SUV in a little bit of cross-country travel, had\ngreat fun zooming over the badlands and through the sand, got lost, hit a\nbig rock, and then he couldn't get it started again. There were no cell\nphone towers anywhere near, so his cell phone was useless. He had no family,\nhis parents had died a few years before in an auto accident, and his few\nfriends had no idea he was out here.\n\nHe stayed with the car for a day or so, but his one bottle of water ran out\nand he was getting thirsty. He thought maybe he knew the direction back, now\nthat he'd paid attention to the sun and thought he'd figured out which way\nwas north, so he decided to start walking. He figured he only had to go\nabout 30 miles or so and he'd be back to the small town he'd gotten gas in\nlast.\n\nHe thinks about walking at night to avoid the heat and sun, but based upon\nhow dark it actually was the night before, and given that he has no\nflashlight, he's afraid that he'll break a leg or step on a rattlesnake. So,\nhe puts on some sun block, puts the rest in his pocket for reapplication\nlater, brings an umbrella he'd had in the back of the SUV with him to give\nhim a little shade, pours the windshield wiper fluid into his water bottle\nin case he gets that desperate, brings his pocket knife in case he finds a\ncactus that looks like it might have water in it, and heads out in the\ndirection he thinks is right.\n\nHe walks for the entire day. By the end of the day he's really thirsty. He's\nbeen sweating all day, and his lips are starting to crack. He's reapplied\nthe sunblock twice, and tried to stay under the umbrella, but he still feels\nsunburned. The windshield wiper fluid sloshing in the bottle in his pocket\nis really getting tempting now. He knows that it's mainly water and some\nethanol and coloring, but he also knows that they add some kind of poison to\nit to keep people from drinking it. He wonders what the poison is, and\nwhether the poison would be worse than dying of thirst.\n\nHe pushes on, trying to get to that small town before dark.\n\nBy the end of the day he starts getting worried. He figures he's been\nwalking at least 3 miles an hour, according to his watch for over 10 hours.\nThat means that if his estimate was right that he should be close to the\ntown. But he doesn't recognize any of this. He had to cross a dry creek bed\na mile or two back, and he doesn't remember coming through it in the SUV. He\nfigures that maybe he got his direction off just a little and that the dry\ncreek bed was just off to one side of his path. He tells himself that he's\nclose, and that after dark he'll start seeing the town lights over one of\nthese hills, and that'll be all he needs.\n\nAs it gets dim enough that he starts stumbling over small rocks and things,\nhe finds a spot and sits down to wait for full dark and the town lights.\n\nFull dark comes before he knows it. He must have dozed off. He stands back\nup and turns all the way around. He sees nothing but stars.\n\nHe wakes up the next morning feeling absolutely lousy. His eyes are gummy\nand his mouth and nose feel like they're full of sand. He so thirsty that he\ncan't even swallow. He barely got any sleep because it was so cold. He'd\nforgotten how cold it got at night in the desert and hadn't noticed it the\nnight before because he'd been in his car.\n\nHe knows the Rule of Threes - three minutes without air, three days without\nwater, three weeks without food - then you die. Some people can make it a\nlittle longer, in the best situations. But the desert heat and having to\nwalk and sweat isn't the best situation to be without water. He figures,\nunless he finds water, this is his last day.\n\nHe rinses his mouth out with a little of the windshield wiper fluid. He\nwaits a while after spitting that little bit out, to see if his mouth goes\nnumb, or he feels dizzy or something. Has his mouth gone numb? Is it just in\nhis mind? He's not sure. He'll go a little farther, and if he still doesn't\nfind water, he'll try drinking some of the fluid.\n\nThen he has to face his next, harder question - which way does he go from\nhere? Does he keep walking the same way he was yesterday (assuming that he\nstill knows which way that is), or does he try a new direction? He has no\nidea what to do.\n\nLooking at the hills and dunes around him, he thinks he knows the direction\nhe was heading before. Just going by a feeling, he points himself somewhat\nto the left of that, and starts walking.\n\nAs he walks, the day starts heating up. The desert, too cold just a couple\nof hours before, soon becomes an oven again. He sweats a little at first,\nand then stops. He starts getting worried at that - when you stop sweating\nhe knows that means you're in trouble - usually right before heat stroke.\n\nHe decides that it's time to try the windshield wiper fluid. He can't wait\nany longer - if he passes out, he's dead. He stops in the shade of a large\nrock, takes the bottle out, opens it, and takes a mouthful. He slowly\nswallows it, making it last as long as he can. It feels so good in his dry\nand cracked throat that he doesn't even care about the nasty taste. He takes\nanother mouthful, and makes it last too. Slowly, he drinks half the bottle.\nHe figures that since he's drinking it, he might as well drink enough to\nmake some difference and keep himself from passing out.\n\nHe's quit worrying about the denaturing of the wiper fluid. If it kills him,\nit kills him - if he didn't drink it, he'd die anyway. Besides, he's pretty\nsure that whatever substance they denature the fluid with is just designed\nto make you sick - their way of keeping winos from buying cheap wiper fluid\nfor the ethanol content. He can handle throwing up, if it comes to that.\n\nHe walks. He walks in the hot, dry, windless desert. Sand, rocks, hills,\ndunes, the occasional scrawny cactus or dried bush. No sign of water.\nSometimes he'll see a little movement to one side or the other, but whatever\nmoved is usually gone before he can focus his eyes on it. Probably birds,\nlizards, or mice. Maybe snakes, though they usually move more at night. He's\ncareful to stay away from the movements.\n\nAfter a while, he begins to stagger. He's not sure if it's fatigue, heat\nstroke finally catching him, or maybe he was wrong and the denaturing of the\nwiper fluid was worse than he thought. He tries to steady himself, and keep\ngoing.\n\nAfter more walking, he comes to a large stretch of sand. This is good! He\nknows he passed over a stretch of sand in the SUV - he remembers doing\ndonuts in it. Or at least he thinks he remembers it - he's getting woozy\nenough and tired enough that he's not sure what he remembers any more or if\nhe's hallucinating. But he thinks he remembers it. So he heads off into it,\ntrying to get to the other side, hoping that it gets him closer to the town.\n\nHe was heading for a town, wasn't he? He thinks he was. He isn't sure any\nmore. He's not even sure how long he's been walking any more. Is it still\nmorning? Or has it moved into afternoon and the sun is going down again? It\nmust be afternoon - it seems like it's been too long since he started out.\n\nHe walks through the sand.\n\nAfter a while, he comes to a big dune in the sand. This is bad. He doesn't\nremember any dunes when driving over the sand in his SUV. Or at least he\ndoesn't think he remembers any. This is bad.\n\nBut, he has no other direction to go. Too late to turn back now. He figures\nthat he'll get to the top of the dune and see if he can see anything from\nthere that helps him find the town. He keeps going up the dune.\n\nHalfway up, he slips in the bad footing of the sand for the second or third\ntime, and falls to his knees. He doesn't feel like getting back up - he'll\njust fall down again. So, he keeps going up the dune on his hand and knees.\n\nWhile crawling, if his throat weren't so dry, he'd laugh. He's finally\ngotten to the hackneyed image of a man lost in the desert - crawling through\nthe sand on his hands and knees. If would be the perfect image, he imagines,\nif only his clothes were more ragged. The people crawling through the desert\nin the cartoons always had ragged clothes. But his have lasted without any\nrips so far. Somebody will probably find his dessicated corpse half buried\nin the sand years from now, and his clothes will still be in fine shape -\nshake the sand out, and a good wash, and they'd be wearable again. He wishes\nhis throat were wet enough to laugh. He coughs a little instead, and it\nhurts.\n\nHe finally makes it to the top of the sand dune. Now that he's at the top,\nhe struggles a little, but manages to stand up and look around. All he sees\nis sand. Sand, and more sand. Behind him, about a mile away, he thinks he\nsees the rocky ground he left to head into this sand. Ahead of him, more\ndunes, more sand. This isn't where he drove his SUV. This is Hell. Or close\nenough.\n\nAgain, he doesn't know what to do. He decides to drink the rest of the wiper\nfluid while figuring it out. He takes out the bottle, and is removing the\ncap, when he glances to the side and sees something. Something in the sand.\nAt the bottom of the dune, off to the side, he sees something strange. It's\na flat area, in the sand. He stops taking the cap of the bottle off, and\ntries to look closer. The area seems to be circular. And it's dark - darker\nthan the sand. And, there seems to be something in the middle of it, but he\ncan't tell what it is. He looks as hard as he can, and still can tell from\nhere. He's going to have to go down there and look.\n\nHe puts the bottle back in his pocket, and starts to stumble down the dune.\nAfter a few steps, he realizes that he's in trouble - he's not going to be\nable to keep his balance. After a couple of more sliding, tottering steps,\nhe falls and starts to roll down the dune. The sand it so hot when his body\nhits it that for a minute he thinks he's caught fire on the way down - like\na movie car wreck flashing into flames as it goes over the cliff, before it\never even hits the ground. He closes his eyes and mouth, covers his face\nwith his hands, and waits to stop rolling.\n\nHe stops, at the bottom of the dune. After a minute or two, he finds enough\nenergy to try to sit up and get the sand out of his face and clothes. When\nhe clears his eyes enough, he looks around to make sure that the dark spot\nin the sand it still there and he hadn't just imagined it.\n\nSo, seeing the large, flat, dark spot on the sand is still there, he begins\nto crawl towards it. He'd get up and walk towards it, but he doesn't seem to\nhave the energy to get up and walk right now. He must be in the final stages\nof dehydration he figures, as he crawls. If this place in the sand doesn't\nhave water, he'll likely never make it anywhere else. This is his last\nchance.\n\nHe gets closer and closer, but still can't see what's in the middle of the\ndark area. His eyes won't quite focus any more for some reason. And lifting\nhis head up to look takes so much effort that he gives up trying. He just\nkeeps crawling.\n\nFinally, he reaches the area he'd seen from the dune. It takes him a minute\nof crawling on it before he realizes that he's no longer on sand - he's now\ncrawling on some kind of dark stone. Stone with some kind of marking on it -\na pattern cut into the stone. He's too tired to stand up and try to see what\nthe pattern is - so he just keeps crawling. He crawls towards the center,\nwhere his blurry eyes still see something in the middle of the dark stone\narea.\n\nHis mind, detached in a strange way, notes that either his hands and knees\nare so burnt by the sand that they no longer feel pain, or that this dark\nstone, in the middle of a burning desert with a pounding, punishing sun\noverhead, doesn't seem to be hot. It almost feels cool. He considers lying\ndown on the nice cool surface.\n\nCool, dark stone. Not a good sign. He must be hallucinating this. He's\nprobably in the middle of a patch of sand, already lying face down and\ndying, and just imagining this whole thing. A desert mirage. Soon the\nbeautiful women carrying pitchers of water will come up and start giving him\na drink. Then he'll know he's gone.\n\nHe decides against laying down on the cool stone. If he's going to die here\nin the middle of this hallucination, he at least wants to see what's in the\ncenter before he goes. He keeps crawling.\n\nIt's the third time that he hears the voice before he realizes what he's\nhearing. He would swear that someone just said, \"Greetings, traveler. You do\nnot look well. Do you hear me?\"\n\nHe stops crawling. He tries to look up from where he is on his hands and\nknees, but it's too much effort to lift his head. So he tries something\ndifferent - he leans back and tries to sit up on the stone. After a few\nseconds, he catches his balance, avoids falling on his face, sits up, and\ntries to focus his eyes. Blurry. He rubs his eyes with the back of his hands\nand tries again. Better this time.\n\nYep. He can see. He's sitting in the middle of a large, flat, dark expanse\nof stone. Directly next to him, about three feet away, is a white post or\npole about two inches in diameter and sticking up about four or five feet\nout of the stone, at an angle.\n\nAnd wrapped around this white rod, tail with rattle on it hovering and\nseeming to be ready to start rattling, is what must be a fifteen foot long\ndesert diamondback rattlesnake, looking directly at him.\n\nHe stares at the snake in shock. He doesn't have the energy to get up and\nrun away. He doesn't even have the energy to crawl away. This is it, his\nfinal resting place. No matter what happens, he's not going to be able to\nmove from this spot.\n\nWell, at least dying of a bite from this monster should be quicker than\ndying of thirst. He'll face his end like a man. He struggles to sit up a\nlittle straighter. The snake keeps watching him. He lifts one hand and waves\nit in the snake's direction, feebly. The snake watches the hand for a\nmoment, then goes back to watching the man, looking into his eyes.\n\nHmmm. Maybe the snake had no interest in biting him? It hadn't rattled yet -\nthat was a good sign. Maybe he wasn't going to die of snake bite after all.\n\nHe then remembers that he'd looked up when he'd reached the center here\nbecause he thought he'd heard a voice. He was still very woozy - he was\nlikely to pass out soon, the sun still beat down on him even though he was\nnow on cool stone. He still didn't have anything to drink. But maybe he had\nactually heard a voice. This stone didn't look natural. Nor did that white\npost sticking up out of the stone. Someone had to have built this. Maybe\nthey were still nearby. Maybe that was who talked to him. Maybe this snake\nwas even their pet, and that's why it wasn't biting.\n\nHe tries to clear his throat to say, \"Hello,\" but his throat is too dry. All\nthat comes out is a coughing or wheezing sound. There is no way he's going\nto be able to talk without something to drink. He feels his pocket, and the\nbottle with the wiper fluid is still there. He shakily pulls the bottle out,\nalmost losing his balance and falling on his back in the process. This isn't\ngood. He doesn't have much time left, by his reckoning, before he passes\nout.\n\nHe gets the lid off of the bottle, manages to get the bottle to his lips,\nand pours some of the fluid into his mouth. He sloshes it around, and then\nswallows it. He coughs a little. His throat feels better. Maybe he can talk\nnow.\n\nHe tries again. Ignoring the snake, he turns to look around him, hoping to\nspot the owner of this place, and croaks out, \"Hello? Is there anyone here?\"\n\nHe hears, from his side, \"Greetings. What is it that you want?\"\n\nHe turns his head, back towards the snake. That's where the sound had seemed\nto come from. The only thing he can think of is that there must be a\nspeaker, hidden under the snake, or maybe built into that post. He decides\nto try asking for help.\n\n\"Please,\" he croaks again, suddenly feeling dizzy, \"I'd love to not be\nthirsty any more. I've been a long time without water. Can you help me?\"\n\nLooking in the direction of the snake, hoping to see where the voice was\ncoming from this time, he is shocked to see the snake rear back, open its\nmouth, and speak. He hears it say, as the dizziness overtakes him and he\nfalls forward, face first on the stone, \"Very well. Coming up.\"\n\nA piercing pain shoots through his shoulder. Suddenly he is awake. He sits\nup and grabs his shoulder, wincing at the throbbing pain. He's momentarily\ndisoriented as he looks around, and then he remembers - the crawl across the\nsand, the dark area of stone, the snake. He sees the snake, still wrapped\naround the tilted white post, still looking at him.\n\nHe reaches up and feels his shoulder, where it hurts. It feels slightly wet.\nHe pulls his fingers away and looks at them - blood. He feels his shoulder\nagain - his shirt has what feels like two holes in it - two puncture holes -\nthey match up with the two aching spots of pain on his shoulder. He had been\nbitten. By the snake.\n\n\"It'll feel better in a minute.\" He looks up - it's the snake talking. He\nhadn't dreamed it. Suddenly he notices - he's not dizzy any more. And more\nimportantly, he's not thirsty any more - at all!\n\n\"Have I died? Is this the afterlife? Why are you biting me in the\nafterlife?\"\n\n\"Sorry about that, but I had to bite you,\" says the snake. \"That's the way I\nwork. It all comes through the bite. Think of it as natural medicine.\"\n\n\"You bit me to help me? Why aren't I thirsty any more? Did you give me a\ndrink before you bit me? How did I drink enough while unconscious to not be\nthirsty any more? I haven't had a drink for over two days. Well, except for\nthe windshield wiper fluid... hold it, how in the world does a snake talk?\nAre you real? Are you some sort of Disney animation?\"\n\n\"No,\" says the snake, \"I'm real. As real as you or anyone is, anyway. I\ndidn't give you a drink. I bit you. That's how it works - it's what I do. I\nbite. I don't have hands to give you a drink, even if I had water just\nsitting around here.\"\n\nThe man sat stunned for a minute. Here he was, sitting in the middle of the\ndesert on some strange stone that should be hot but wasn't, talking to a\nsnake that could talk back and had just bitten him. And he felt better. Not\ngreat - he was still starving and exhausted, but much better - he was no\nlonger thirsty. He had started to sweat again, but only slightly. He felt\nhot, in this sun, but it was starting to get lower in the sky, and the cool\nstone beneath him was a relief he could notice now that he was no longer\ndying of thirst.\n\n\"I might suggest that we take care of that methanol you now have in your\nsystem with the next request,\" continued the snake. \"I can guess why you\ndrank it, but I'm not sure how much you drank, or how much methanol was left\nin the wiper fluid. That stuff is nasty. It'll make you go blind in a day or\ntwo, if you drank enough of it.\"\n\n\"Ummm, n-next request?\" said the man. He put his hand back on his hurting\nshoulder and backed away from the snake a little.\n\n\"That's the way it works. If you like, that is,\" explained the snake. \"You\nget three requests. Call them wishes, if you wish.\" The snake grinned at his\nown joke, and the man drew back a little further from the show of fangs.\n\n\"But there are rules,\" the snake continued. \"The first request is free. The\nsecond requires an agreement of secrecy. The third requires the binding of\nresponsibility.\" The snake looks at the man seriously.\n\n\"By the way,\" the snake says suddenly, \"my name is Nathan. Old Nathan,\nSamuel used to call me. He gave me the name. Before that, most of the Bound\nused to just call me 'Snake'. But that got old, and Samuel wouldn't stand\nfor it. He said that anything that could talk needed a name. He was big into\nnames. You can call me Nate, if you wish.\" Again, the snake grinned. \"Sorry\nif I don't offer to shake, but I think you can understand - my shake sounds\nsomewhat threatening.\" The snake give his rattle a little shake.\n\n\"Umm, my name is Jack,\" said the man, trying to absorb all of this. \"Jack\nSamson.\n\n\"Can I ask you a question?\" Jack says suddenly. \"What happened to the\npoison...umm, in your bite. Why aren't I dying now? How did you do that?\nWhat do you mean by that's how you work?\"\n\n\"That's more than one question,\" grins Nate. \"But I'll still try to answer\nall of them. First, yes, you can ask me a question.\" The snake's grin gets\nwider. \"Second, the poison is in you. It changed you. You now no longer need\nto drink. That's what you asked for. Or, well, technically, you asked to not\nbe thirsty any more - but 'any more' is such a vague term. I decided to make\nit permanent - now, as long as you live, you shouldn't need to drink much at\nall. Your body will conserve water very efficiently. You should be able to\nget enough just from the food you eat - much like a creature of the desert.\nYou've been changed.\n\n\"For the third question,\" Nate continues, \"you are still dying. Besides the\neffects of that methanol in your system, you're a man - and men are mortal.\nIn your current state, I give you no more than about another 50 years.\nAssuming you get out of this desert, alive, that is.\" Nate seemed vastly\namused at his own humor, and continued his wide grin.\n\n\"As for the fourth question,\" Nate said, looking more serious as far as Jack\ncould tell, as Jack was just now working on his ability to read\ntalking-snake emotions from snake facial features, \"first you have to agree\nto make a second request and become bound by the secrecy, or I can't tell\nyou.\"\n\n\"Wait,\" joked Jack, \"isn't this where you say you could tell me, but you'd\nhave to kill me?\"\n\n\"I thought that was implied.\" Nate continued to look serious.\n\n\"Ummm...yeah.\" Jack leaned back a little as he remembered again that he was\ntalking to a fifteen foot poisonous reptile with a reputation for having a\nnasty temper. \"So, what is this 'Bound by Secrecy' stuff, and can you really\nstop the effects of the methanol?\" Jack thought for a second. \"And, what do\nyou mean methanol, anyway? I thought these days they use ethanol in wiper\nfluid, and just denature it?\"\n\n\"They may, I don't really know,\" said Nate. \"I haven't gotten out in a\nwhile. Maybe they do. All I know is that I smell methanol on your breath and\non that bottle in your pocket. And the blue color of the liquid when you\npulled it out to drink some let me guess that it was wiper fluid. I assume\nthat they still color wiper fluid blue?\"\n\n\"Yeah, they do,\" said Jack.\n\n\"I figured,\" replied Nate. \"As for being bound by secrecy - with the\nfulfillment of your next request, you will be bound to say nothing about me,\nthis place, or any of the information I will tell you after that, when you\ndecide to go back out to your kind. You won't be allowed to talk about me,\nwrite about me, use sign language, charades, or even act in a way that will\nlead someone to guess correctly about me. You'll be bound to secrecy. Of\ncourse, I'll also ask you to promise not to give me away, and as I'm\nguessing that you're a man of your word, you'll never test the binding\nanyway, so you won't notice.\" Nate said the last part with utter confidence.\n\nJack, who had always prided himself on being a man of his word, felt a\nlittle nervous at this. \"Ummm, hey, Nate, who are you? How did you know\nthat? Are you, umm, omniscient, or something?\"\n\nWell, Jack,\" said Nate sadly, \"I can't tell you that, unless you make the\nsecond request.\" Nate looked away for a minute, then looked back.\n\n\"Umm, well, ok,\" said Jack, \"what is this about a second request? What can I\nask for? Are you allowed to tell me that?\"\n\n\"Sure!\" said Nate, brightening. \"You're allowed to ask for changes. Changes\nto yourself. They're like wishes, but they can only affect you. Oh, and\nbefore you ask, I can't give you immortality. Or omniscience. Or\nomnipresence, for that matter. Though I might be able to make you gaseous\nand yet remain alive, and then you could spread through the atmosphere and\nsort of be omnipresent. But what good would that be - you still wouldn't be\nomniscient and thus still could only focus on one thing at a time. Not very\nuseful, at least in my opinion.\" Nate stopped when he realized that Jack was\nstaring at him.\n\n\"Well, anyway,\" continued Nate, \"I'd probably suggest giving you permanent\ngood health. It would negate the methanol now in your system, you'd be\nimmune to most poisons and diseases, and you'd tend to live a very long\ntime, barring accident, of course. And you'll even have a tendency to\nrecover from accidents well. It always seemed like a good choice for a\nrequest to me.\"\n\n\"Cure the methanol poisoning, huh?\" said Jack. \"And keep me healthy for a\nlong time? Hmmm. It doesn't sound bad at that. And it has to be a request\nabout a change to me? I can't ask to be rich, right? Because that's not\nreally a change to me?\"\n\n\"Right,\" nodded Nate.\n\n\"Could I ask to be a genius and permanently healthy?\" Jack asked, hopefully.\n\n\"That takes two requests, Jack.\"\n\n\"Yeah, I figured so,\" said Jack. \"But I could ask to be a genius? I could\nbecome the smartest scientist in the world? Or the best athlete?\"\n\n\"Well, I could make you very smart,\" admitted Nate, \"but that wouldn't\nnecessarily make you the best scientist in the world. Or, I could make you\nvery athletic, but it wouldn't necessarily make you the best athlete either.\nYou've heard the saying that 99% of genius is hard work? Well, there's some\ntruth to that. I can give you the talent, but I can't make you work hard. It\nall depends on what you decide to do with it.\"\n\n\"Hmmm,\" said Jack. \"Ok, I think I understand. And I get a third request,\nafter this one?\"\n\n\"Maybe,\" said Nate, \"it depends on what you decide then. There are more\nrules for the third request that I can only tell you about after the second\nrequest. You know how it goes.\" Nate looked like he'd shrug, if he had\nshoulders.\n\n\"Ok, well, since I'd rather not be blind in a day or two, and permanent\nhealth doesn't sound bad, then consider that my second request. Officially.\nDo I need to sign in blood or something?\"\n\n\"No,\" said Nate. \"Just hold out your hand. Or heel.\" Nate grinned. \"Or\nwhatever part you want me to bite. I have to bite you again. Like I said,\nthat's how it works - the poison, you know,\" Nate said apologetically.\n\nJack winced a little and felt his shoulder, where the last bite was. Hey, it\ndidn't hurt any more. Just like Nate had said. That made Jack feel better\nabout the biting business. But still, standing still while a fifteen foot\nsnake sunk it's fangs into you. Jack stood up. Ignoring how good it felt to\nbe able to stand again, and the hunger starting to gnaw at his stomach, Jack\ntried to decide where he wanted to get bitten. Despite knowing that it\nwouldn't hurt for long, Jack knew that this wasn't going to be easy.\n\n\"Hey, Jack,\" Nate suddenly said, looking past Jack towards the dunes behind\nhim, \"is that someone else coming up over there?\"\n\nJack spun around and looked. Who else could be out here in the middle of\nnowhere? And did they bring food?\n\nWait a minute, there was nobody over there. What was Nate...\n\nJack let out a bellow as he felt two fangs sink into his rear end, through\nhis jeans...\n\nJack sat down carefully, favoring his more tender buttock. \"I would have\ndecided, eventually, Nate. I was just thinking about it. You didn't have to\nhoodwink me like that.\"\n\n\"I've been doing this a long time, Jack,\" said Nate, confidently. \"You\nhumans have a hard time sitting still and letting a snake bite you -\nespecially one my size. And besides, admit it - it's only been a couple of\nminutes and it already doesn't hurt any more, does it? That's because of the\nhealth benefit with this one. I told you that you'd heal quickly now.\"\n\n\"Yeah, well, still,\" said Jack, \"it's the principle of the thing. And nobody\nlikes being bitten in the butt! Couldn't you have gotten my calf or\nsomething instead?\"\n\n\"More meat in the typical human butt,\" replied Nate. \"And less chance you\naccidentally kick me or move at the last second.\"\n\n\"Yeah, right. So, tell me all of these wonderful secrets that I now qualify\nto hear,\" answered Jack.\n\n\"Ok,\" said Nate. \"Do you want to ask questions first, or do you want me to\njust start talking?\"\n\n\"Just talk,\" said Jack. \"I'll sit here and try to not think about food.\"\n\n\"We could go try to rustle up some food for you first, if you like,\"\nanswered Nate.\n\n\"Hey! You didn't tell me you had food around here, Nate!\" Jack jumped up.\n\"What do we have? Am I in walking distance to town? Or can you magically\nwhip up food along with your other powers?\" Jack was almost shouting with\nexcitement. His stomach had been growling for hours.\n\n\"I was thinking more like I could flush something out of its hole and bite\nit for you, and you could skin it and eat it. Assuming you have a knife,\nthat is,\" replied Nate, with the grin that Jack was starting to get used to.\n\n\"Ugh,\" said Jack, sitting back down. \"I think I'll pass. I can last a little\nlonger before I get desperate enough to eat desert rat, or whatever else it\nis you find out here. And there's nothing to burn - I'd have to eat it raw.\nNo thanks. Just talk.\"\n\n\"Ok,\" replied Nate, still grinning. \"But I'd better hurry, before you start\nlooking at me as food.\n\nNate reared back a little, looked around for a second, and then continued.\n\"You, Jack, are sitting in the middle of the Garden of Eden.\"\n\nJack looked around at the sand and dunes and then looked back at Nate\nsceptically.\n\n\"Well, that's the best I can figure it, anyway, Jack,\" said Nate. \"Stand up\nand look at the symbol on the rock here.\" Nate gestured around the dark\nstone they were both sitting on with his nose.\n\nJack stood up and looked. Carved into the stone in a bas-relief was a\nrepresentation of a large tree. The angled-pole that Nate was wrapped around\nwas coming out of the trunk of the tree, right below where the main branches\nleft the truck to reach out across the stone. It was very well done - it\nlooked more like a tree had been reduced to almost two dimensions and\nembedded in the stone than it did like a carving.\n\nJack walked around and looked at the details in the fading light of the\nsetting sun. He wished he'd looked at it while the sun was higher in the\nsky.\n\nWait! The sun was setting! That meant he was going to have to spend another\nnight out here! Arrrgh!\n\nJack looked out across the desert for a little bit, and then came back and\nstood next to Nate. \"In all the excitement, I almost forgot, Nate,\" said\nJack. \"Which way is it back to town? And how far? I'm eventually going to\nhave to head back - I'm not sure I'll be able to survive by eating raw\ndesert critters for long. And even if I can, I'm not sure I'll want to.\"\n\n\"It's about 30 miles that way.\" Nate pointed, with the rattle on his tail\nthis time. As far as Jack could tell, it was a direction at right angles to\nthe way he'd been going when he was crawling here. \"But that's 30 miles by\nthe way the crow flies. It's about 40 by the way a man walks. You should be\nable to do it in about half a day with your improved endurance, if you head\nout early tomorrow, Jack.\"\n\nJack looked out the way the snake had pointed for a few seconds more, and\nthen sat back down. It was getting dark. Not much he could do about heading\nout right now. And besides, Nate was just about to get to the interesting\nstuff. \"Garden of Eden? As best as you can figure it?\"\n\n\"Well, yeah, as best as I and Samuel could figure it anyway,\" said Nate. \"He\nfigured that the story just got a little mixed up. You know, snake, in a\n'tree', offering 'temptations', making bargains. That kind stuff. But he\ncould never quite figure out how the Hebrews found out about this spot from\nacross the ocean. He worried about that for a while.\"\n\n\"Garden of Eden, hunh?\" said Jack. \"How long have you been here, Nate?\"\n\n\"No idea, really,\" replied Nate. \"A long time. It never occurred to me to\ncount years, until recently, and by then, of course, it was too late. But I\ndo remember when this whole place was green, so I figure it's been thousands\nof years, at least.\"\n\n\"So, are you the snake that tempted Eve?\" said Jack.\n\n\"Beats me,\" said Nate. \"Maybe. I can't remember if the first one of your\nkind that I talked to was female or not, and I never got a name, but it\ncould have been. And I suppose she could have considered my offer to grant\nrequests a 'temptation', though I've rarely had refusals.\"\n\n\"Well, umm, how did you get here then? And why is that white pole stuck out\nof the stone there?\" asked Jack.\n", "likes": null, "suggested_sort": null, "user_reports": [], "link_flair_text": null, "gilded": 0, "archived": true, "clicked": false, "title": "So, there's a man crawling through the desert.", "_has_fetched": true, "_comment_sort": null, "_replaced_more": false, "over_18": false, "hidden": false, "hide_score": false, "link_flair_css_class": null, "_info_url": "https://api.reddit.com/api/info/", "downs": 0, "saved": false, "removal_reason": null, "from_id": null, "locked": false, "name": "t3_sipek", "author_flair_text": null, "quarantine": false, "visited": false, "num_reports": null, "distinguished": null, "domain": "self.Jokes", "_comments_by_id": {}, "_api_link": "https://api.reddit.com/r/Jokes/comments/sipek/so_theres_a_man_crawling_through_the_desert/?ref=search_posts", "media_embed": {}, "secure_media": null, "id": "sipek", "from_kind": null, "secure_media_embed": {}, "report_reasons": null, "author": "jordane182", "media": null, "_orphaned": {}, "score": 6, "approved_by": null, "_uniq": null, "thumbnail": "", "edited": false, "author_flair_css_class": null, "reddit_session": "Unauthenticated reddit session", "mod_reports": [], "from": null, "is_self": true, "_comments": null, "_params": {}, "_underscore_names": null, "permalink": "https://www.reddit.com/r/Jokes/comments/sipek/so_theres_a_man_crawling_through_the_desert/?ref=search_posts", "stickied": false, "created": 1334908265.0, "url": "https://www.reddit.com/r/Jokes/comments/sipek/so_theres_a_man_crawling_through_the_desert/", "created_utc": 1334879465.0, "ups": 6, "num_comments": 15}, {"json_dict": null, "banned_by": null, "subreddit_id": "t5_2qh72", "subreddit": "Jokes", "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>and the first priests complains about having bats in his bell tower. &quot;They just moved in and I can&#39;t seem to be able to get them to leave.&quot;</p>\n\n<p>The second priest chirps up with the same problem. &quot;I&#39;ve had them for 2 years now and nothing I do makes any difference.&quot;</p>\n\n<p>Finaly the third priests speaks up after a big bite of his lunch. &quot;Ya, I use to have that problem too.&quot;</p>\n\n<p>&quot;How did you get rid of them?&quot;</p>\n\n<p>&quot;I baptized them; now the only come around for Christmas and Easter.&quot;</p>\n</div><!-- SC_ON -->", "selftext": "and the first priests complains about having bats in his bell tower. \"They just moved in and I can't seem to be able to get them to leave.\"\n\nThe second priest chirps up with the same problem. \"I've had them for 2 years now and nothing I do makes any difference.\"\n\nFinaly the third priests speaks up after a big bite of his lunch. \"Ya, I use to have that problem too.\"\n\n\"How did you get rid of them?\"\n\n\"I baptized them; now the only come around for Christmas and Easter.\"", "likes": null, "suggested_sort": null, "user_reports": [], "link_flair_text": null, "gilded": 0, "archived": true, "clicked": false, "title": "So three priests are having lunch...", "_has_fetched": true, "_comment_sort": null, "_replaced_more": false, "over_18": false, "hidden": false, "hide_score": false, "link_flair_css_class": null, "_info_url": "https://api.reddit.com/api/info/", "downs": 0, "saved": false, "removal_reason": null, "from_id": null, "locked": false, "name": "t3_shxtg", "author_flair_text": null, "quarantine": false, "visited": false, "num_reports": null, "distinguished": null, "domain": "self.Jokes", "_comments_by_id": {}, "_api_link": "https://api.reddit.com/r/Jokes/comments/shxtg/so_three_priests_are_having_lunch/?ref=search_posts", "media_embed": {}, "secure_media": null, "id": "shxtg", "from_kind": null, "secure_media_embed": {}, "report_reasons": null, "author": "Maxatron4000", "media": null, "_orphaned": {}, "score": 112, "approved_by": null, "_uniq": null, "thumbnail": "", "edited": false, "author_flair_css_class": null, "reddit_session": "Unauthenticated reddit session", "mod_reports": [], "from": null, "is_self": true, "_comments": null, "_params": {}, "_underscore_names": null, "permalink": "https://www.reddit.com/r/Jokes/comments/shxtg/so_three_priests_are_having_lunch/?ref=search_posts", "stickied": false, "created": 1334878890.0, "url": "https://www.reddit.com/r/Jokes/comments/shxtg/so_three_priests_are_having_lunch/", "created_utc": 1334850090.0, "ups": 112, "num_comments": 4}, {"json_dict": null, "banned_by": null, "subreddit_id": "t5_2qh72", "subreddit": "Jokes", "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Purrformance enhancing drugs.</p>\n</div><!-- SC_ON -->", "selftext": "Purrformance enhancing drugs.", "likes": null, "suggested_sort": null, "user_reports": [], "link_flair_text": null, "gilded": 0, "archived": true, "clicked": false, "title": "How do you make a cat much louder?", "_has_fetched": true, "_comment_sort": null, "_replaced_more": false, "over_18": false, "hidden": false, "hide_score": false, "link_flair_css_class": null, "_info_url": "https://api.reddit.com/api/info/", "downs": 0, "saved": false, "removal_reason": null, "from_id": null, "locked": false, "name": "t3_silbq", "author_flair_text": null, "quarantine": false, "visited": false, "num_reports": null, "distinguished": null, "domain": "self.Jokes", "_comments_by_id": {}, "_api_link": "https://api.reddit.com/r/Jokes/comments/silbq/how_do_you_make_a_cat_much_louder/?ref=search_posts", "media_embed": {}, "secure_media": null, "id": "silbq", "from_kind": null, "secure_media_embed": {}, "report_reasons": null, "author": "tudormorris", "media": null, "_orphaned": {}, "score": 0, "approved_by": null, "_uniq": null, "thumbnail": "", "edited": false, "author_flair_css_class": null, "reddit_session": "Unauthenticated reddit session", "mod_reports": [], "from": null, "is_self": true, "_comments": null, "_params": {}, "_underscore_names": null, "permalink": "https://www.reddit.com/r/Jokes/comments/silbq/how_do_you_make_a_cat_much_louder/?ref=search_posts", "stickied": false, "created": 1334903711.0, "url": "https://www.reddit.com/r/Jokes/comments/silbq/how_do_you_make_a_cat_much_louder/", "created_utc": 1334874911.0, "ups": 0, "num_comments": 0}, {"json_dict": null, "banned_by": null, "subreddit_id": "t5_2qh72", "subreddit": "Jokes", "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Tom went to the doctors office for a physical check at the big age of 35. The normal routine check went fine and what he was most nervous for happened. &quot; Drop you pants and bend over&quot; he says, &quot; Don&#39; worry it will be quick and painless&quot;. He continues to put his gloves on and lubes them up really good. As he continues to do his job he says &quot; Do you feel anything, does it hurt&quot;, It sounded awkward but hey lets tell him thought Tom. &quot; It hurts a bit&quot; he replied. The doctor as the funny guy that he has alway been continues to say, &quot; Let me show you a magic trick&quot; as he places both hands in front of Tom&#39;s face says &quot;Look no hands&quot;. </p>\n</div><!-- SC_ON -->", "selftext": "Tom went to the doctors office for a physical check at the big age of 35. The normal routine check went fine and what he was most nervous for happened. \" Drop you pants and bend over\" he says, \" Don' worry it will be quick and painless\". He continues to put his gloves on and lubes them up really good. As he continues to do his job he says \" Do you feel anything, does it hurt\", It sounded awkward but hey lets tell him thought Tom. \" It hurts a bit\" he replied. The doctor as the funny guy that he has alway been continues to say, \" Let me show you a magic trick\" as he places both hands in front of Tom's face says \"Look no hands\". \n", "likes": null, "suggested_sort": null, "user_reports": [], "link_flair_text": null, "gilded": 0, "archived": true, "clicked": false, "title": "Is my doctor a magician?", "_has_fetched": true, "_comment_sort": null, "_replaced_more": false, "over_18": false, "hidden": false, "hide_score": false, "link_flair_css_class": null, "_info_url": "https://api.reddit.com/api/info/", "downs": 0, "saved": false, "removal_reason": null, "from_id": null, "locked": false, "name": "t3_shv2z", "author_flair_text": null, "quarantine": false, "visited": false, "num_reports": null, "distinguished": null, "domain": "self.Jokes", "_comments_by_id": {}, "_api_link": "https://api.reddit.com/r/Jokes/comments/shv2z/is_my_doctor_a_magician/?ref=search_posts", "media_embed": {}, "secure_media": null, "id": "shv2z", "from_kind": null, "secure_media_embed": {}, "report_reasons": null, "author": "longshlong1", "media": null, "_orphaned": {}, "score": 0, "approved_by": null, "_uniq": null, "thumbnail": "", "edited": false, "author_flair_css_class": null, "reddit_session": "Unauthenticated reddit session", "mod_reports": [], "from": null, "is_self": true, "_comments": null, "_params": {}, "_underscore_names": null, "permalink": "https://www.reddit.com/r/Jokes/comments/shv2z/is_my_doctor_a_magician/?ref=search_posts", "stickied": false, "created": 1334875541.0, "url": "https://www.reddit.com/r/Jokes/comments/shv2z/is_my_doctor_a_magician/", "created_utc": 1334846741.0, "ups": 0, "num_comments": 1}, {"json_dict": null, "banned_by": null, "subreddit_id": "t5_2qh72", "subreddit": "Jokes", "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&quot;You have cancer and Alzheimer&#39;s.&quot;</p>\n\n<p>&quot;Oh, well, at least I don&#39;t have cancer.&quot;</p>\n</div><!-- SC_ON -->", "selftext": "\"You have cancer and Alzheimer's.\"\n\n\"Oh, well, at least I don't have cancer.\"", "likes": null, "suggested_sort": null, "user_reports": [], "link_flair_text": null, "gilded": 0, "archived": true, "clicked": false, "title": "\"I'm afraid I have some very bad news, sir,\" the doctor said.", "_has_fetched": true, "_comment_sort": null, "_replaced_more": false, "over_18": false, "hidden": false, "hide_score": false, "link_flair_css_class": null, "_info_url": "https://api.reddit.com/api/info/", "downs": 0, "saved": false, "removal_reason": null, "from_id": null, "locked": false, "name": "t3_sig2d", "author_flair_text": null, "quarantine": false, "visited": false, "num_reports": null, "distinguished": null, "domain": "self.Jokes", "_comments_by_id": {}, "_api_link": "https://api.reddit.com/r/Jokes/comments/sig2d/im_afraid_i_have_some_very_bad_news_sir_the/?ref=search_posts", "media_embed": {}, "secure_media": null, "id": "sig2d", "from_kind": null, "secure_media_embed": {}, "report_reasons": null, "author": "zendak", "media": null, "_orphaned": {}, "score": 42, "approved_by": null, "_uniq": null, "thumbnail": "", "edited": false, "author_flair_css_class": null, "reddit_session": "Unauthenticated reddit session", "mod_reports": [], "from": null, "is_self": true, "_comments": null, "_params": {}, "_underscore_names": null, "permalink": "https://www.reddit.com/r/Jokes/comments/sig2d/im_afraid_i_have_some_very_bad_news_sir_the/?ref=search_posts", "stickied": false, "created": 1334898224.0, "url": "https://www.reddit.com/r/Jokes/comments/sig2d/im_afraid_i_have_some_very_bad_news_sir_the/", "created_utc": 1334869424.0, "ups": 42, "num_comments": 1}, {"json_dict": null, "banned_by": null, "subreddit_id": "t5_2qh72", "subreddit": "Jokes", "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The bitch can suck my dick in the dark for all I care....</p>\n</div><!-- SC_ON -->", "selftext": "The bitch can suck my dick in the dark for all I care....", "likes": null, "suggested_sort": null, "user_reports": [], "link_flair_text": null, "gilded": 0, "archived": true, "clicked": false, "title": "How many feminists does it take to screw in a lightbulb?", "_has_fetched": true, "_comment_sort": null, "_replaced_more": false, "over_18": false, "hidden": false, "hide_score": false, "link_flair_css_class": null, "_info_url": "https://api.reddit.com/api/info/", "downs": 0, "saved": false, "removal_reason": null, "from_id": null, "locked": false, "name": "t3_sifuq", "author_flair_text": null, "quarantine": false, "visited": false, "num_reports": null, "distinguished": null, "domain": "self.Jokes", "_comments_by_id": {}, "_api_link": "https://api.reddit.com/r/Jokes/comments/sifuq/how_many_feminists_does_it_take_to_screw_in_a/?ref=search_posts", "media_embed": {}, "secure_media": null, "id": "sifuq", "from_kind": null, "secure_media_embed": {}, "report_reasons": null, "author": "Johnny_Scotchdrinker", "media": null, "_orphaned": {}, "score": 0, "approved_by": null, "_uniq": null, "thumbnail": "", "edited": false, "author_flair_css_class": null, "reddit_session": "Unauthenticated reddit session", "mod_reports": [], "from": null, "is_self": true, "_comments": null, "_params": {}, "_underscore_names": null, "permalink": "https://www.reddit.com/r/Jokes/comments/sifuq/how_many_feminists_does_it_take_to_screw_in_a/?ref=search_posts", "stickied": false, "created": 1334898035.0, "url": "https://www.reddit.com/r/Jokes/comments/sifuq/how_many_feminists_does_it_take_to_screw_in_a/", "created_utc": 1334869235.0, "ups": 0, "num_comments": 1}, {"json_dict": null, "banned_by": null, "subreddit_id": "t5_2qh72", "subreddit": "Jokes", "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There was man who hadn&#39;t gotten laid in a while and wanted to have sex really badly. So he decides to go to the red light district and hire a hooker. He notices a hooker who was asking for $20 a night, while the hooker next to her was asking for $50. Then he notices the third hooker who was asking for $100. The man was curious. &quot;What is so special about <em>her</em> that makes are 2-5 times more expensive than others?&quot; thought the man. He decides to give himself the best night of sexy time possible and hires the $100 hooker. They decide to go to a motel for sexy times. The man was really curious about the hookers fee. &quot;Why $100?&quot; he kept asking himself. Once they get to the room, the man finally decides to ask the hooker. The hooker smirks and starts taking off her clothes. Once she is completely undressed, she asks the man to put one finger in her vagina. The man complies. She then asks her to put two fingers in there, once that is done, put your entire hand in there. The man does as he is told. Much to man&#39;s surprise, the hooker asks him to put his other hand in her vagina too. Man, a bit worried, terrified and aroused at the same time, once again does as he is told. Then she makes - what the man thought was - a really weird request. She asked him to try and clap his hands whilst they were still in her vagina. The man makes several unsuccessful attempts before admitting defeat. &quot;I can&#39;t&quot; he said. The hooker looked at his face and stared into his eyes and said, &quot;in the other ones, you can.&quot;</p>\n</div><!-- SC_ON -->", "selftext": "There was man who hadn't gotten laid in a while and wanted to have sex really badly. So he decides to go to the red light district and hire a hooker. He notices a hooker who was asking for $20 a night, while the hooker next to her was asking for $50. Then he notices the third hooker who was asking for $100. The man was curious. \"What is so special about *her* that makes are 2-5 times more expensive than others?\" thought the man. He decides to give himself the best night of sexy time possible and hires the $100 hooker. They decide to go to a motel for sexy times. The man was really curious about the hookers fee. \"Why $100?\" he kept asking himself. Once they get to the room, the man finally decides to ask the hooker. The hooker smirks and starts taking off her clothes. Once she is completely undressed, she asks the man to put one finger in her vagina. The man complies. She then asks her to put two fingers in there, once that is done, put your entire hand in there. The man does as he is told. Much to man's surprise, the hooker asks him to put his other hand in her vagina too. Man, a bit worried, terrified and aroused at the same time, once again does as he is told. Then she makes - what the man thought was - a really weird request. She asked him to try and clap his hands whilst they were still in her vagina. The man makes several unsuccessful attempts before admitting defeat. \"I can't\" he said. The hooker looked at his face and stared into his eyes and said, \"in the other ones, you can.\"", "likes": null, "suggested_sort": null, "user_reports": [], "link_flair_text": null, "gilded": 0, "archived": true, "clicked": false, "title": "Hookers for $20, $50 or $100.", "_has_fetched": true, "_comment_sort": null, "_replaced_more": false, "over_18": false, "hidden": false, "hide_score": false, "link_flair_css_class": null, "_info_url": "https://api.reddit.com/api/info/", "downs": 0, "saved": false, "removal_reason": null, "from_id": null, "locked": false, "name": "t3_sifc3", "author_flair_text": null, "quarantine": false, "visited": false, "num_reports": null, "distinguished": null, "domain": "self.Jokes", "_comments_by_id": {}, "_api_link": "https://api.reddit.com/r/Jokes/comments/sifc3/hookers_for_20_50_or_100/?ref=search_posts", "media_embed": {}, "secure_media": null, "id": "sifc3", "from_kind": null, "secure_media_embed": {}, "report_reasons": null, "author": "rjddude1", "media": null, "_orphaned": {}, "score": 70, "approved_by": null, "_uniq": null, "thumbnail": "", "edited": false, "author_flair_css_class": null, "reddit_session": "Unauthenticated reddit session", "mod_reports": [], "from": null, "is_self": true, "_comments": null, "_params": {}, "_underscore_names": null, "permalink": "https://www.reddit.com/r/Jokes/comments/sifc3/hookers_for_20_50_or_100/?ref=search_posts", "stickied": false, "created": 1334897556.0, "url": "https://www.reddit.com/r/Jokes/comments/sifc3/hookers_for_20_50_or_100/", "created_utc": 1334868756.0, "ups": 70, "num_comments": 6}, {"json_dict": null, "banned_by": null, "subreddit_id": "t5_2qh72", "subreddit": "Jokes", "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Aids.</p>\n</div><!-- SC_ON -->", "selftext": "Aids.", "likes": null, "suggested_sort": null, "user_reports": [], "link_flair_text": null, "gilded": 0, "archived": true, "clicked": false, "title": "How do you turn a fruit into a vegetable?", "_has_fetched": true, "_comment_sort": null, "_replaced_more": false, "over_18": false, "hidden": false, "hide_score": false, "link_flair_css_class": null, "_info_url": "https://api.reddit.com/api/info/", "downs": 0, "saved": false, "removal_reason": null, "from_id": null, "locked": false, "name": "t3_sif08", "author_flair_text": null, "quarantine": false, "visited": false, "num_reports": null, "distinguished": null, "domain": "self.Jokes", "_comments_by_id": {}, "_api_link": "https://api.reddit.com/r/Jokes/comments/sif08/how_do_you_turn_a_fruit_into_a_vegetable/?ref=search_posts", "media_embed": {}, "secure_media": null, "id": "sif08", "from_kind": null, "secure_media_embed": {}, "report_reasons": null, "author": "Armadilldo", "media": null, "_orphaned": {}, "score": 14, "approved_by": null, "_uniq": null, "thumbnail": "", "edited": false, "author_flair_css_class": null, "reddit_session": "Unauthenticated reddit session", "mod_reports": [], "from": null, "is_self": true, "_comments": null, "_params": {}, "_underscore_names": null, "permalink": "https://www.reddit.com/r/Jokes/comments/sif08/how_do_you_turn_a_fruit_into_a_vegetable/?ref=search_posts", "stickied": false, "created": 1334897249.0, "url": "https://www.reddit.com/r/Jokes/comments/sif08/how_do_you_turn_a_fruit_into_a_vegetable/", "created_utc": 1334868449.0, "ups": 14, "num_comments": 11}, {"json_dict": null, "banned_by": null, "subreddit_id": "t5_2qh72", "subreddit": "Jokes", "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>and I&#39;m chatting her up. Telling her that she&#39;s really hot and that I want to take her out and have some fun with her. Out of nowhere she says really loud &quot;You&#39;re a pedophile.&quot; I told her, &quot;Whoa, that&#39;s an awfully big word for an 8 year old.&quot;</p>\n</div><!-- SC_ON -->", "selftext": "and I'm chatting her up. Telling her that she's really hot and that I want to take her out and have some fun with her. Out of nowhere she says really loud \"You're a pedophile.\" I told her, \"Whoa, that's an awfully big word for an 8 year old.\"", "likes": null, "suggested_sort": null, "user_reports": [], "link_flair_text": null, "gilded": 0, "archived": true, "clicked": false, "title": "So I meet this girl ...", "_has_fetched": true, "_comment_sort": null, "_replaced_more": false, "over_18": false, "hidden": false, "hide_score": false, "link_flair_css_class": null, "_info_url": "https://api.reddit.com/api/info/", "downs": 0, "saved": false, "removal_reason": null, "from_id": null, "locked": false, "name": "t3_si7ca", "author_flair_text": null, "quarantine": false, "visited": false, "num_reports": null, "distinguished": null, "domain": "self.Jokes", "_comments_by_id": {}, "_api_link": "https://api.reddit.com/r/Jokes/comments/si7ca/so_i_meet_this_girl/?ref=search_posts", "media_embed": {}, "secure_media": null, "id": "si7ca", "from_kind": null, "secure_media_embed": {}, "report_reasons": null, "author": "sandman_car", "media": null, "_orphaned": {}, "score": 22, "approved_by": null, "_uniq": null, "thumbnail": "", "edited": false, "author_flair_css_class": null, "reddit_session": "Unauthenticated reddit session", "mod_reports": [], "from": null, "is_self": true, "_comments": null, "_params": {}, "_underscore_names": null, "permalink": "https://www.reddit.com/r/Jokes/comments/si7ca/so_i_meet_this_girl/?ref=search_posts", "stickied": false, "created": 1334889317.0, "url": "https://www.reddit.com/r/Jokes/comments/si7ca/so_i_meet_this_girl/", "created_utc": 1334860517.0, "ups": 22, "num_comments": 0}, {"json_dict": null, "banned_by": null, "subreddit_id": "t5_2qh72", "subreddit": "Jokes", "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Diabetes. John has diabetes.</p>\n</div><!-- SC_ON -->", "selftext": "Diabetes. John has diabetes.", "likes": null, "suggested_sort": null, "user_reports": [], "link_flair_text": null, "gilded": 0, "archived": true, "clicked": false, "title": "If John has 50 candy bars and eats 45, how many does he have?", "_has_fetched": true, "_comment_sort": null, "_replaced_more": false, "over_18": false, "hidden": false, "hide_score": false, "link_flair_css_class": null, "_info_url": "https://api.reddit.com/api/info/", "downs": 0, "saved": false, "removal_reason": null, "from_id": null, "locked": false, "name": "t3_si4zn", "author_flair_text": null, "quarantine": false, "visited": false, "num_reports": null, "distinguished": null, "domain": "self.Jokes", "_comments_by_id": {}, "_api_link": "https://api.reddit.com/r/Jokes/comments/si4zn/if_john_has_50_candy_bars_and_eats_45_how_many/?ref=search_posts", "media_embed": {}, "secure_media": null, "id": "si4zn", "from_kind": null, "secure_media_embed": {}, "report_reasons": null, "author": "Tallain", "media": null, "_orphaned": {}, "score": 0, "approved_by": null, "_uniq": null, "thumbnail": "", "edited": false, "author_flair_css_class": null, "reddit_session": "Unauthenticated reddit session", "mod_reports": [], "from": null, "is_self": true, "_comments": null, "_params": {}, "_underscore_names": null, "permalink": "https://www.reddit.com/r/Jokes/comments/si4zn/if_john_has_50_candy_bars_and_eats_45_how_many/?ref=search_posts", "stickied": false, "created": 1334886795.0, "url": "https://www.reddit.com/r/Jokes/comments/si4zn/if_john_has_50_candy_bars_and_eats_45_how_many/", "created_utc": 1334857995.0, "ups": 0, "num_comments": 6}, {"json_dict": null, "banned_by": null, "subreddit_id": "t5_2qh72", "subreddit": "Jokes", "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If your girlfriend understands to give texting a rest when you&#39;re playing video games, marry her.</p>\n</div><!-- SC_ON -->", "selftext": "If your girlfriend understands to give texting a rest when you're playing video games, marry her.", "likes": null, "suggested_sort": null, "user_reports": [], "link_flair_text": null, "gilded": 0, "archived": true, "clicked": false, "title": "No more \"if you're bf stops playing his game to text you...\"", "_has_fetched": true, "_comment_sort": null, "_replaced_more": false, "over_18": false, "hidden": false, "hide_score": false, "link_flair_css_class": null, "_info_url": "https://api.reddit.com/api/info/", "downs": 0, "saved": false, "removal_reason": null, "from_id": null, "locked": false, "name": "t3_shy0s", "author_flair_text": null, "quarantine": false, "visited": false, "num_reports": null, "distinguished": null, "domain": "self.Jokes", "_comments_by_id": {}, "_api_link": "https://api.reddit.com/r/Jokes/comments/shy0s/no_more_if_youre_bf_stops_playing_his_game_to/?ref=search_posts", "media_embed": {}, "secure_media": null, "id": "shy0s", "from_kind": null, "secure_media_embed": {}, "report_reasons": null, "author": "Raider1213", "media": null, "_orphaned": {}, "score": 0, "approved_by": null, "_uniq": null, "thumbnail": "", "edited": false, "author_flair_css_class": null, "reddit_session": "Unauthenticated reddit session", "mod_reports": [], "from": null, "is_self": true, "_comments": null, "_params": {}, "_underscore_names": null, "permalink": "https://www.reddit.com/r/Jokes/comments/shy0s/no_more_if_youre_bf_stops_playing_his_game_to/?ref=search_posts", "stickied": false, "created": 1334879138.0, "url": "https://www.reddit.com/r/Jokes/comments/shy0s/no_more_if_youre_bf_stops_playing_his_game_to/", "created_utc": 1334850338.0, "ups": 0, "num_comments": 0}, {"json_dict": null, "banned_by": null, "subreddit_id": "t5_2qh72", "subreddit": "Jokes", "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Tequillllaaaa</p>\n</div><!-- SC_ON -->", "selftext": "Tequillllaaaa", "likes": null, "suggested_sort": null, "user_reports": [], "link_flair_text": null, "gilded": 0, "archived": true, "clicked": false, "title": "Why did the Mexican push his wife off a cliff?", "_has_fetched": true, "_comment_sort": null, "_replaced_more": false, "over_18": false, "hidden": false, "hide_score": false, "link_flair_css_class": null, "_info_url": "https://api.reddit.com/api/info/", "downs": 0, "saved": false, "removal_reason": null, "from_id": null, "locked": false, "name": "t3_shohs", "author_flair_text": null, "quarantine": false, "visited": false, "num_reports": null, "distinguished": null, "domain": "self.Jokes", "_comments_by_id": {}, "_api_link": "https://api.reddit.com/r/Jokes/comments/shohs/why_did_the_mexican_push_his_wife_off_a_cliff/?ref=search_posts", "media_embed": {}, "secure_media": null, "id": "shohs", "from_kind": null, "secure_media_embed": {}, "report_reasons": null, "author": "investinginnonesense", "media": null, "_orphaned": {}, "score": 37, "approved_by": null, "_uniq": null, "thumbnail": "", "edited": false, "author_flair_css_class": null, "reddit_session": "Unauthenticated reddit session", "mod_reports": [], "from": null, "is_self": true, "_comments": null, "_params": {}, "_underscore_names": null, "permalink": "https://www.reddit.com/r/Jokes/comments/shohs/why_did_the_mexican_push_his_wife_off_a_cliff/?ref=search_posts", "stickied": false, "created": 1334865303.0, "url": "https://www.reddit.com/r/Jokes/comments/shohs/why_did_the_mexican_push_his_wife_off_a_cliff/", "created_utc": 1334836503.0, "ups": 37, "num_comments": 4}, {"json_dict": null, "banned_by": null, "subreddit_id": "t5_2qh72", "subreddit": "Jokes", "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A: Because they held up a pair of pants.</p>\n</div><!-- SC_ON -->", "selftext": "A: Because they held up a pair of pants.", "likes": null, "suggested_sort": null, "user_reports": [], "link_flair_text": null, "gilded": 0, "archived": true, "clicked": false, "title": "Q: Why did the suspenders get arrested?", "_has_fetched": true, "_comment_sort": null, "_replaced_more": false, "over_18": false, "hidden": false, "hide_score": false, "link_flair_css_class": null, "_info_url": "https://api.reddit.com/api/info/", "downs": 0, "saved": false, "removal_reason": null, "from_id": null, "locked": false, "name": "t3_shmvy", "author_flair_text": null, "quarantine": false, "visited": false, "num_reports": null, "distinguished": null, "domain": "self.Jokes", "_comments_by_id": {}, "_api_link": "https://api.reddit.com/r/Jokes/comments/shmvy/q_why_did_the_suspenders_get_arrested/?ref=search_posts", "media_embed": {}, "secure_media": null, "id": "shmvy", "from_kind": null, "secure_media_embed": {}, "report_reasons": null, "author": "Retaxess", "media": null, "_orphaned": {}, "score": 16, "approved_by": null, "_uniq": null, "thumbnail": "", "edited": false, "author_flair_css_class": null, "reddit_session": "Unauthenticated reddit session", "mod_reports": [], "from": null, "is_self": true, "_comments": null, "_params": {}, "_underscore_names": null, "permalink": "https://www.reddit.com/r/Jokes/comments/shmvy/q_why_did_the_suspenders_get_arrested/?ref=search_posts", "stickied": false, "created": 1334861592.0, "url": "https://www.reddit.com/r/Jokes/comments/shmvy/q_why_did_the_suspenders_get_arrested/", "created_utc": 1334832792.0, "ups": 16, "num_comments": 1}, {"json_dict": null, "banned_by": null, "subreddit_id": "t5_2qh72", "subreddit": "Jokes", "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A child and a pedophile were walking into a dark forest, late at night. The child held the pedophile&#39;s hand tightly and said, &quot;I&#39;m scared!&quot;</p>\n\n<p>The pedophile said, &quot;you&#39;re scared? I have to walk back out of here ALONE!&quot;</p>\n</div><!-- SC_ON -->", "selftext": "A child and a pedophile were walking into a dark forest, late at night. The child held the pedophile's hand tightly and said, \"I'm scared!\"\n\nThe pedophile said, \"you're scared? I have to walk back out of here ALONE!\"", "likes": null, "suggested_sort": null, "user_reports": [], "link_flair_text": null, "gilded": 0, "archived": true, "clicked": false, "title": "a child and a pedophile walk into the forest... ", "_has_fetched": true, "_comment_sort": null, "_replaced_more": false, "over_18": false, "hidden": false, "hide_score": false, "link_flair_css_class": null, "_info_url": "https://api.reddit.com/api/info/", "downs": 0, "saved": false, "removal_reason": null, "from_id": null, "locked": false, "name": "t3_sh947", "author_flair_text": null, "quarantine": false, "visited": false, "num_reports": null, "distinguished": null, "domain": "self.Jokes", "_comments_by_id": {}, "_api_link": "https://api.reddit.com/r/Jokes/comments/sh947/a_child_and_a_pedophile_walk_into_the_forest/?ref=search_posts", "media_embed": {}, "secure_media": null, "id": "sh947", "from_kind": null, "secure_media_embed": {}, "report_reasons": null, "author": "dodogenocide", "media": null, "_orphaned": {}, "score": 14, "approved_by": null, "_uniq": null, "thumbnail": "", "edited": false, "author_flair_css_class": null, "reddit_session": "Unauthenticated reddit session", "mod_reports": [], "from": null, "is_self": true, "_comments": null, "_params": {}, "_underscore_names": null, "permalink": "https://www.reddit.com/r/Jokes/comments/sh947/a_child_and_a_pedophile_walk_into_the_forest/?ref=search_posts", "stickied": false, "created": 1334835017.0, "url": "https://www.reddit.com/r/Jokes/comments/sh947/a_child_and_a_pedophile_walk_into_the_forest/", "created_utc": 1334806217.0, "ups": 14, "num_comments": 7}, {"json_dict": null, "banned_by": null, "subreddit_id": "t5_2qh72", "subreddit": "Jokes", "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>...walk into a bar.  &quot;ouch&quot; &quot;quack&quot;</p>\n</div><!-- SC_ON -->", "selftext": "...walk into a bar.  \"ouch\" \"quack\"", "likes": null, "suggested_sort": null, "user_reports": [], "link_flair_text": null, "gilded": 0, "archived": true, "clicked": false, "title": "Man and a duck...", "_has_fetched": true, "_comment_sort": null, "_replaced_more": false, "over_18": false, "hidden": false, "hide_score": false, "link_flair_css_class": null, "_info_url": "https://api.reddit.com/api/info/", "downs": 0, "saved": false, "removal_reason": null, "from_id": null, "locked": false, "name": "t3_sh78t", "author_flair_text": null, "quarantine": false, "visited": false, "num_reports": null, "distinguished": null, "domain": "self.Jokes", "_comments_by_id": {}, "_api_link": "https://api.reddit.com/r/Jokes/comments/sh78t/man_and_a_duck/?ref=search_posts", "media_embed": {}, "secure_media": null, "id": "sh78t", "from_kind": null, "secure_media_embed": {}, "report_reasons": null, "author": "djdeejay06", "media": null, "_orphaned": {}, "score": 0, "approved_by": null, "_uniq": null, "thumbnail": "", "edited": false, "author_flair_css_class": null, "reddit_session": "Unauthenticated reddit session", "mod_reports": [], "from": null, "is_self": true, "_comments": null, "_params": {}, "_underscore_names": null, "permalink": "https://www.reddit.com/r/Jokes/comments/sh78t/man_and_a_duck/?ref=search_posts", "stickied": false, "created": 1334832913.0, "url": "https://www.reddit.com/r/Jokes/comments/sh78t/man_and_a_duck/", "created_utc": 1334804113.0, "ups": 0, "num_comments": 2}, {"json_dict": null, "banned_by": null, "subreddit_id": "t5_2qh72", "subreddit": "Jokes", "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"http://en.wikipedia.org/wiki/Leonid_Brezhnev\">Leonid Brezhnev</a> during the unofficial time of one of his visits to the USA was chatting with Reagan about their hobbies. Reagan told Brezhnev that he was collecting cars. &quot;Interesting&quot;, says Brezhnev. How many do you already have? &quot;Not really sure, probably two full parking lots. What do you collect, Leonid?&quot; &quot;I collect jokes about myself&quot;. &quot;That must be fun! How large is your collection?&quot; &quot;Umm, two or three full concentration camps at least&quot;.</p>\n\n<p>When Brezhnev was provided with a list of candidates for the main Rabbi of the USSR, he got very cross: &quot;But there are only Jews in that list!&quot;</p>\n\n<p>During his trip to Paris Brezhnev was taken on a tour to the most famous Paris whorehouse. He liked one of the girls and told her that for the purpose of liberating her from the slavery of Madame he would give his personal recommendation for her to be accepted as the member of the French Communist Party. &quot;Merci, Monsieur, but, alas, I cannot accept it - I had enough trouble with my mother obtaining her permission for joining the bordello&quot;. </p>\n\n<p>Mr. Brezhnev is reading the speech at the opening ceremony of the 1980 Olympic Games in Moscow: &quot;Dear comrades, let me declare the 20th summer olympic games open! Oh! Oh! Oh!...&quot; The assistant: &quot;Leonid Ilyich, please do not read that - this is the symbol of the olympic movement&quot;.</p>\n\n<p>Two vampires caught Brezhnev and tore of his head. The first one prepared to start sucking blood from the neck, the second one stops him: &quot;Pour into a decanter, you peasant! This is VSOP - <a href=\"http://www.songfacts.com/songimages/22352.jpg\">five stars</a>!&quot;</p>\n\n<p>After a speech at one of the receptions Brezhnev scolds his secretary: &quot;Had not I told you that the speech you wrote for me was supposed to be for 15 minutes maximum? I spent an hour reading it!&quot; &quot;Leonid Ilyich, sorry, but you did not have to read all four copies!&quot;</p>\n\n<p>At the end of the press conference with foreign journalists: &quot;Thank you, Leonid Ilyich, no more questions!&quot; &quot;What?!?! I still have two more answers!&quot;</p>\n\n<p>At the press conference with foreign journalists: &quot;Some enemies of the Soviet Union malign me by claiming that I read all of my speeches written for me by my assistants, comma, wait for reaction form audience, continue, but this is totally untrue...&quot;</p>\n\n<p>Brezhnev at the session of <a href=\"http://en.wikipedia.org/wiki/Politburo_of_the_Central_Committee_of_the_Communist_Party_of_the_Soviet_Union\">Politbureau</a>: &quot;Comrades! Most members of Politbureau are marasmic! Riding wooden horses, playing with toy cars! This is unacceptable - we are the rulers of the greatest country in the world! And Comrade <a href=\"http://en.wikipedia.org/wiki/Andrei_Gromyko\">Gromyko</a> has snatched away my tin soldiers and is not returning them!&quot; </p>\n</div><!-- SC_ON -->", "selftext": "[Leonid Brezhnev](http://en.wikipedia.org/wiki/Leonid_Brezhnev) during the unofficial time of one of his visits to the USA was chatting with Reagan about their hobbies. Reagan told Brezhnev that he was collecting cars. \"Interesting\", says Brezhnev. How many do you already have? \"Not really sure, probably two full parking lots. What do you collect, Leonid?\" \"I collect jokes about myself\". \"That must be fun! How large is your collection?\" \"Umm, two or three full concentration camps at least\".\n\nWhen Brezhnev was provided with a list of candidates for the main Rabbi of the USSR, he got very cross: \"But there are only Jews in that list!\"\n\nDuring his trip to Paris Brezhnev was taken on a tour to the most famous Paris whorehouse. He liked one of the girls and told her that for the purpose of liberating her from the slavery of Madame he would give his personal recommendation for her to be accepted as the member of the French Communist Party. \"Merci, Monsieur, but, alas, I cannot accept it - I had enough trouble with my mother obtaining her permission for joining the bordello\". \n\nMr. Brezhnev is reading the speech at the opening ceremony of the 1980 Olympic Games in Moscow: \"Dear comrades, let me declare the 20th summer olympic games open! Oh! Oh! Oh!...\" The assistant: \"Leonid Ilyich, please do not read that - this is the symbol of the olympic movement\".\n\nTwo vampires caught Brezhnev and tore of his head. The first one prepared to start sucking blood from the neck, the second one stops him: \"Pour into a decanter, you peasant! This is VSOP - [five stars](http://www.songfacts.com/songimages/22352.jpg)!\"\n\nAfter a speech at one of the receptions Brezhnev scolds his secretary: \"Had not I told you that the speech you wrote for me was supposed to be for 15 minutes maximum? I spent an hour reading it!\" \"Leonid Ilyich, sorry, but you did not have to read all four copies!\"\n\nAt the end of the press conference with foreign journalists: \"Thank you, Leonid Ilyich, no more questions!\" \"What?!?! I still have two more answers!\"\n\nAt the press conference with foreign journalists: \"Some enemies of the Soviet Union malign me by claiming that I read all of my speeches written for me by my assistants, comma, wait for reaction form audience, continue, but this is totally untrue...\"\n\nBrezhnev at the session of [Politbureau](http://en.wikipedia.org/wiki/Politburo_of_the_Central_Committee_of_the_Communist_Party_of_the_Soviet_Union): \"Comrades! Most members of Politbureau are marasmic! Riding wooden horses, playing with toy cars! This is unacceptable - we are the rulers of the greatest country in the world! And Comrade [Gromyko] (http://en.wikipedia.org/wiki/Andrei_Gromyko) has snatched away my tin soldiers and is not returning them!\" ", "likes": null, "suggested_sort": null, "user_reports": [], "link_flair_text": null, "gilded": 0, "archived": true, "clicked": false, "title": "A collection of USSR period jokes. With Mr. Putin back in power for god know how long, expect the new generation and new variations of them.", "_has_fetched": true, "_comment_sort": null, "_replaced_more": false, "over_18": false, "hidden": false, "hide_score": false, "link_flair_css_class": null, "_info_url": "https://api.reddit.com/api/info/", "downs": 0, "saved": false, "removal_reason": null, "from_id": null, "locked": false, "name": "t3_shh2y", "author_flair_text": null, "quarantine": false, "visited": false, "num_reports": null, "distinguished": null, "domain": "self.Jokes", "_comments_by_id": {}, "_api_link": "https://api.reddit.com/r/Jokes/comments/shh2y/a_collection_of_ussr_period_jokes_with_mr_putin/?ref=search_posts", "media_embed": {}, "secure_media": null, "id": "shh2y", "from_kind": null, "secure_media_embed": {}, "report_reasons": null, "author": "Zabiyaka", "media": null, "_orphaned": {}, "score": 25, "approved_by": null, "_uniq": null, "thumbnail": "", "edited": false, "author_flair_css_class": null, "reddit_session": "Unauthenticated reddit session", "mod_reports": [], "from": null, "is_self": true, "_comments": null, "_params": {}, "_underscore_names": null, "permalink": "https://www.reddit.com/r/Jokes/comments/shh2y/a_collection_of_ussr_period_jokes_with_mr_putin/?ref=search_posts", "stickied": false, "created": 1334845932.0, "url": "https://www.reddit.com/r/Jokes/comments/shh2y/a_collection_of_ussr_period_jokes_with_mr_putin/", "created_utc": 1334817132.0, "ups": 25, "num_comments": 5}, {"json_dict": null, "banned_by": null, "subreddit_id": "t5_2qh72", "subreddit": "Jokes", "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A former Sergeant , having served his time with the Marine Corps, took a new job as a school teacher, but just before the school year started he injured his back.\nHe was required to wear a plaster cast around the upper part of his body.\nFortunately, the cast fit under his shirt and wasn&#39;t noticeable. On the first day of class, he found himself assigned to the toughest students in the school. The smart-alec punks, having already heard the new teacher was a former Marine, were leery of him and decided to see how tough he really was, before trying any pranks. Walking confidently into the rowdy classroom, the new teacher opened the window wide and sat down at his desk. When a strong breeze made his tie flap, he picked up a stapler and promptly stapled the tie to his chest. Dead silence ... He had no trouble with discipline that year. </p>\n</div><!-- SC_ON -->", "selftext": "A former Sergeant , having served his time with the Marine Corps, took a new job as a school teacher, but just before the school year started he injured his back.\nHe was required to wear a plaster cast around the upper part of his body.\nFortunately, the cast fit under his shirt and wasn't noticeable. On the first day of class, he found himself assigned to the toughest students in the school. The smart-alec punks, having already heard the new teacher was a former Marine, were leery of him and decided to see how tough he really was, before trying any pranks. Walking confidently into the rowdy classroom, the new teacher opened the window wide and sat down at his desk. When a strong breeze made his tie flap, he picked up a stapler and promptly stapled the tie to his chest. Dead silence ... He had no trouble with discipline that year. ", "likes": null, "suggested_sort": null, "user_reports": [], "link_flair_text": null, "gilded": 0, "archived": true, "clicked": false, "title": "No problems", "_has_fetched": true, "_comment_sort": null, "_replaced_more": false, "over_18": false, "hidden": false, "hide_score": false, "link_flair_css_class": null, "_info_url": "https://api.reddit.com/api/info/", "downs": 0, "saved": false, "removal_reason": null, "from_id": null, "locked": false, "name": "t3_shc55", "author_flair_text": null, "quarantine": false, "visited": false, "num_reports": null, "distinguished": null, "domain": "self.Jokes", "_comments_by_id": {}, "_api_link": "https://api.reddit.com/r/Jokes/comments/shc55/no_problems/?ref=search_posts", "media_embed": {}, "secure_media": null, "id": "shc55", "from_kind": null, "secure_media_embed": {}, "report_reasons": null, "author": "corf1", "media": null, "_orphaned": {}, "score": 284, "approved_by": null, "_uniq": null, "thumbnail": "", "edited": false, "author_flair_css_class": null, "reddit_session": "Unauthenticated reddit session", "mod_reports": [], "from": null, "is_self": true, "_comments": null, "_params": {}, "_underscore_names": null, "permalink": "https://www.reddit.com/r/Jokes/comments/shc55/no_problems/?ref=search_posts", "stickied": false, "created": 1334838500.0, "url": "https://www.reddit.com/r/Jokes/comments/shc55/no_problems/", "created_utc": 1334809700.0, "ups": 284, "num_comments": 15}, {"json_dict": null, "banned_by": null, "subreddit_id": "t5_2qh72", "subreddit": "Jokes", "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I can&#39;t jelly this joke onto <a href=\"/r/jokes\">/r/jokes</a> everyday</p>\n</div><!-- SC_ON -->", "selftext": "I can't jelly this joke onto /r/jokes everyday", "likes": null, "suggested_sort": null, "user_reports": [], "link_flair_text": null, "gilded": 0, "archived": true, "clicked": false, "title": "What's the difference between jelly and jam?", "_has_fetched": true, "_comment_sort": null, "_replaced_more": false, "over_18": false, "hidden": false, "hide_score": false, "link_flair_css_class": null, "_info_url": "https://api.reddit.com/api/info/", "downs": 0, "saved": false, "removal_reason": null, "from_id": null, "locked": false, "name": "t3_shaxx", "author_flair_text": null, "quarantine": false, "visited": false, "num_reports": null, "distinguished": null, "domain": "self.Jokes", "_comments_by_id": {}, "_api_link": "https://api.reddit.com/r/Jokes/comments/shaxx/whats_the_difference_between_jelly_and_jam/?ref=search_posts", "media_embed": {}, "secure_media": null, "id": "shaxx", "from_kind": null, "secure_media_embed": {}, "report_reasons": null, "author": "Ostro", "media": null, "_orphaned": {}, "score": 0, "approved_by": null, "_uniq": null, "thumbnail": "", "edited": false, "author_flair_css_class": null, "reddit_session": "Unauthenticated reddit session", "mod_reports": [], "from": null, "is_self": true, "_comments": null, "_params": {}, "_underscore_names": null, "permalink": "https://www.reddit.com/r/Jokes/comments/shaxx/whats_the_difference_between_jelly_and_jam/?ref=search_posts", "stickied": false, "created": 1334837075.0, "url": "https://www.reddit.com/r/Jokes/comments/shaxx/whats_the_difference_between_jelly_and_jam/", "created_utc": 1334808275.0, "ups": 0, "num_comments": 0}, {"json_dict": null, "banned_by": null, "subreddit_id": "t5_2qh72", "subreddit": "Jokes", "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Everything seemed to be going fine.  Then all of a sudden the doc stuck his finger up my butt!  I freaked out a bit.  Is this a normal part of the exam?  </p>\n\n<p>I&#39;m thinking of finding a new dentist.</p>\n</div><!-- SC_ON -->", "selftext": "Everything seemed to be going fine.  Then all of a sudden the doc stuck his finger up my butt!  I freaked out a bit.  Is this a normal part of the exam?  \n\nI'm thinking of finding a new dentist.", "likes": null, "suggested_sort": null, "user_reports": [], "link_flair_text": null, "gilded": 0, "archived": true, "clicked": false, "title": "I went in for a check up...", "_has_fetched": true, "_comment_sort": null, "_replaced_more": false, "over_18": false, "hidden": false, "hide_score": false, "link_flair_css_class": null, "_info_url": "https://api.reddit.com/api/info/", "downs": 0, "saved": false, "removal_reason": null, "from_id": null, "locked": false, "name": "t3_sh99t", "author_flair_text": null, "quarantine": false, "visited": false, "num_reports": null, "distinguished": null, "domain": "self.Jokes", "_comments_by_id": {}, "_api_link": "https://api.reddit.com/r/Jokes/comments/sh99t/i_went_in_for_a_check_up/?ref=search_posts", "media_embed": {}, "secure_media": null, "id": "sh99t", "from_kind": null, "secure_media_embed": {}, "report_reasons": null, "author": "tjw", "media": null, "_orphaned": {}, "score": 36, "approved_by": null, "_uniq": null, "thumbnail": "", "edited": false, "author_flair_css_class": null, "reddit_session": "Unauthenticated reddit session", "mod_reports": [], "from": null, "is_self": true, "_comments": null, "_params": {}, "_underscore_names": null, "permalink": "https://www.reddit.com/r/Jokes/comments/sh99t/i_went_in_for_a_check_up/?ref=search_posts", "stickied": false, "created": 1334835191.0, "url": "https://www.reddit.com/r/Jokes/comments/sh99t/i_went_in_for_a_check_up/", "created_utc": 1334806391.0, "ups": 36, "num_comments": 1}, {"json_dict": null, "banned_by": null, "subreddit_id": "t5_2qh72", "subreddit": "Jokes", "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>They have such a hard time fitting in. (NSFW with imagination)</p>\n</div><!-- SC_ON -->", "selftext": "They have such a hard time fitting in. (NSFW with imagination)\n", "likes": null, "suggested_sort": null, "user_reports": [], "link_flair_text": null, "gilded": 0, "archived": true, "clicked": false, "title": "I feel bad for Pedophiles", "_has_fetched": true, "_comment_sort": null, "_replaced_more": false, "over_18": true, "hidden": false, "hide_score": false, "link_flair_css_class": null, "_info_url": "https://api.reddit.com/api/info/", "downs": 0, "saved": false, "removal_reason": null, "from_id": null, "locked": false, "name": "t3_sgd28", "author_flair_text": null, "quarantine": false, "visited": false, "num_reports": null, "distinguished": null, "domain": "self.Jokes", "_comments_by_id": {}, "_api_link": "https://api.reddit.com/r/Jokes/comments/sgd28/i_feel_bad_for_pedophiles/?ref=search_posts", "media_embed": {}, "secure_media": null, "id": "sgd28", "from_kind": null, "secure_media_embed": {}, "report_reasons": null, "author": "Austio", "media": null, "_orphaned": {}, "score": 457, "approved_by": null, "_uniq": null, "thumbnail": "", "edited": true, "author_flair_css_class": null, "reddit_session": "Unauthenticated reddit session", "mod_reports": [], "from": null, "is_self": true, "_comments": null, "_params": {}, "_underscore_names": null, "permalink": "https://www.reddit.com/r/Jokes/comments/sgd28/i_feel_bad_for_pedophiles/?ref=search_posts", "stickied": false, "created": 1334801160.0, "url": "https://www.reddit.com/r/Jokes/comments/sgd28/i_feel_bad_for_pedophiles/", "created_utc": 1334772360.0, "ups": 457, "num_comments": 79}]